{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"adapter","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A class that enables two otherwise incompatible systems to work together without modifying the systems' source code. Examples include database adapters, cache adapters, filesystem adapters, post-processor libraries adapters and other types of computing adapters.</p>"}},{"node":{"frontmatter":{"title":"above the fold","wordClasses":["adjective"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>In a browser window, the content that is immediately visible after a web page loads and before a user scrolls down the page. When designing your layout, use flexible formats to best display the highest priority products, features, sales, notifications, options, etc in this area.</p>\n<p>With mobile and tablets, the area of above the fold greatly differs, especially on the size and dimensions of the screen and orientation when viewing (portrait vs landscape). Using responsive themes and testing can help find the right mix of content and layout.</p>"}},{"node":{"frontmatter":{"title":"alt text","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":null},"html":"<p>In a web browser when a user is unable to view an image, alt text (embedded in the HTML code) appears in place of the image. Also, blind or visually impaired users are able to interpret web mages through alt text as they navigate with a screen reader.</p>"}},{"node":{"frontmatter":{"title":"adminhtml","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["area","magento-admin"]},"html":"<p>The internal area name assigned to the Magento Admin.</p>"}},{"node":{"frontmatter":{"title":"anchor text","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["search engine optimization"]},"html":"<p>The text, or label, in a hyperlink that is visible and clickable. Anchor text is important in search engine optimization.</p>"}},{"node":{"frontmatter":{"title":"area","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["DevDocs - Modules and Areas","Magento component","storefront"]},"html":"<p>Area is an abstract term for a Magento application scope. Areas are logical components that organize code for optimized request processing. Areas reduce the memory demands of configuration objects accessed from the storefront, and they streamline web service calls by loading only the required dependent code. Each area can contain completely different code to process URLs and requests.</p>\n<p>Magento areas include:</p>\n<ul>\n<li>Magento Admin (adminhtml)</li>\n<li>Storefront (frontend)</li>\n<li>Web API REST (webapi_rest)</li>\n</ul>"}},{"node":{"frontmatter":{"title":"backend","wordClasses":["noun","adjective"],"tags":["Programming"],"synonyms":["server side"],"relatedTerms":["server side","frontend","cache backend"]},"html":"<p>Generally used in the same way as \"server side\".</p>"}},{"node":{"frontmatter":{"title":"base currency","wordClasses":["noun"],"tags":["Pricing"],"synonyms":[],"relatedTerms":null},"html":"<p>The primary currency that is used per store view for all online payments.</p>"}},{"node":{"frontmatter":{"title":"batch processing","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>To perform a task or make a change to multiple items all at once, without manual repetition.</p>"}},{"node":{"frontmatter":{"title":"blacklist","wordClasses":["noun","verb"],"tags":[null],"synonyms":[],"relatedTerms":["whitelist"]},"html":"<p>A method of filtering data that excludes the data specified on a list and includes everything else.</p>"}},{"node":{"frontmatter":{"title":"bounce rate","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The percentage of website visitors that land on a page and then leave without navigating further into the site.</p>"}},{"node":{"frontmatter":{"title":"brand","wordClasses":["noun","verb"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>A unique identity that defines a particular product or group of products.</p>"}},{"node":{"frontmatter":{"title":"brick-and-mortar","wordClasses":["adjective"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>A retail business with a permanent physical location, as opposed to businesses that function virtually or solely through the internet.</p>"}},{"node":{"frontmatter":{"title":"cache backend","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["backend"]},"html":"<p>Stores cache records into a two-level backend system within Zend’s default framework. A first-level cache is fast — for example, an APC or Memcached backend — but it’s limited and doesn’t support tagging and grouping of cache entries. A second-level cache — for example, a file system or a Redis backend — is slower but supports tagging and grouping.</p>"}},{"node":{"frontmatter":{"title":"cache type","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Overview of Cache Types","Manage the Cache"]},"html":"<p>A cache stores data so that future calls for that data can be loaded quicker, and Magento includes these types: configuration, layout, block HTML layout, full page (the most well-known), collections, DDL, EAV, reflection, translation, integration configuration, integration API configuration, web services configuration. Other types can be created and defined.</p>"}},{"node":{"frontmatter":{"title":"cache frontend","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["frontend"]},"html":"<p>Specifies what kind of data is stored in the cache backend.</p>"}},{"node":{"frontmatter":{"title":"cache","wordClasses":["noun","verb"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Pages (or parts of pages) that are stored to improve the page load time of subsequent requests.</p>"}},{"node":{"frontmatter":{"title":"canonical URL","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["search engine optimization","URL"]},"html":"<p>A page's single preferred URL, which can be referenced from multiple URLs. Aids in search engine optimization.</p>"}},{"node":{"frontmatter":{"title":"capture","wordClasses":["verb"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":["authorization","order status"]},"html":"<p>The process of converting an authorized order amount into a billable transaction. Transactions cannot be captured until authorized, and authorizations cannot be captured until the goods or services have been shipped.</p>"}},{"node":{"frontmatter":{"title":"cardholder","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A person who is authorized by a financial institution to make purchases on a credit card account.</p>"}},{"node":{"frontmatter":{"title":"cloud services","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["software as a service","platform as a service","payments as a service"]},"html":"<p>A resource provided over the internet that hosts or shares computer processing capability and data to computers and other devices on demand. Cloud services include software as a service (SaaS), platform as a service (PaaS) and infrastructure as a service (IaaS).\nBenefits include:\n• Infrastructure costs avoided\n• Savings in infrastructure passed on to core business\n• Applications can be implemented quicker\n• More uptime, when the system is working an available, due to redundancy\n• Less maintenance</p>"}},{"node":{"frontmatter":{"title":"CMS","wordClasses":["noun"],"tags":["Programming"],"synonyms":["content management system"],"relatedTerms":null},"html":"<p>Abbreviation for \"content management system.\" A software system that is used to create, edit, and maintain content on a website.</p>"}},{"node":{"frontmatter":{"title":"code migration","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>In general, processes related to translating code from one application to another. The Magento code migration tool assists you with porting Magento 1 customizations to Magento 2.</p>"}},{"node":{"frontmatter":{"title":"Compass","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["CSS","Sass"]},"html":"<p>An open-source CSS authoring framework that is an extension of the Sass stylesheet language. Compass includes a compiler and a large collection of mixins and functions. Can be bundled into a library and used in multiple projects without requiring using multiple sources for each project.</p>"}},{"node":{"frontmatter":{"title":"complex data","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Data that is associated with multiple product options.</p>"}},{"node":{"frontmatter":{"title":"Composer package","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Composer","Composer website","package"]},"html":"<p>A library, or file bundle, that is obtained using Composer — an external software — and that provides functionality or fulfills a dependency. The content of the package contains PHP code, a name and a version that identify the package, as well as metadata. For installation, the source definition is the information that is most relevant — this describes where to get the package contents and any dependencies.</p>"}},{"node":{"frontmatter":{"title":"Composer","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>The technology used to download items that works manages dependencies in PHP. This tool allows users to specify libraries to be used and it manages the installation and updates for the libraries. </p>\n<p>A “package” is the composer’s smallest unit of delivery. Example: A .zip file containing a directory tree of files. Composer places each Magento component — module, theme or language pack — to be downloaded into a separate package, creating a 1:1 relationship between components and packages.</p>"}},{"node":{"frontmatter":{"title":"composite pattern","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>The composite pattern is a programming design pattern that describes the uniform treatment of single objects or a composition of objects.</p>"}},{"node":{"frontmatter":{"title":"content delivery network","wordClasses":["noun"],"tags":["Programming"],"synonyms":["CDN"],"relatedTerms":null},"html":"<p>A large distributed network of servers that specializes in the high performance delivery of multimedia content.</p>"}},{"node":{"frontmatter":{"title":"content marketing","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The art of promoting products or services by providing valuable information at no charge.</p>"}},{"node":{"frontmatter":{"title":"conversion rate","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>The percentage of visitors who are converted into buyers.</p>"}},{"node":{"frontmatter":{"title":"conversion","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A marketing term that indicates when a goal is reached. If the goal is to sell a product, conversion is reached when a visitor becomes a buyer.</p>"}},{"node":{"frontmatter":{"title":"credit memo comment","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>Details why a credit memo amount was credited to the customer.</p>"}},{"node":{"frontmatter":{"title":"credit memo item","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>An invoiced item for which a merchant creates a credit memo.</p>"}},{"node":{"frontmatter":{"title":"credit memo","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A document issued by the merchant to a customer to write off an outstanding balance because of overcharge, rebate, or return of goods. The memo restores funds to the customer's account.</p>"}},{"node":{"frontmatter":{"title":"cross-sell","wordClasses":["noun","adjective","verb"],"tags":["Business / Marketing","Product"],"synonyms":[],"relatedTerms":["upsell"]},"html":"<p>A product that appears next to the shopping cart. When a customer navigates to the shopping cart page, these products are displayed as cross-sells to the items already in the shopping cart. They are similar to impulse buys, like magazines and candy at the cash registers in grocery stores.</p>"}},{"node":{"frontmatter":{"title":"CSV","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":["comma-separated values"],"relatedTerms":null},"html":"<p>An abbreviation for \"comma-separated values\". A type of file used to store data values which are separated from each other by commas, using one row for each set of values.</p>"}},{"node":{"frontmatter":{"title":"CVM","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":["Cardholder Verification Method"],"relatedTerms":["security code"]},"html":"<p>An abbreviation for \"Cardholder Verification Method\". A way to verify the identity of the customer by confirming a 3-digit or 4-digit credit card security code with the payment processor.</p>"}},{"node":{"frontmatter":{"title":"database schema","wordClasses":["noun"],"tags":["Programming"],"synonyms":["schema"],"relatedTerms":null},"html":"<p>The structure of data in a database. Defines how data is organized and how data relationships are governed, including all constraints applied to the data. A module can contain fragments of the database schema if that module has data that needs to be stored in the database.</p>"}},{"node":{"frontmatter":{"title":"dependency injection","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A software design pattern that allows a class to specify its dependencies without having to construct them. This class delegates the responsibility of injecting the dependency to the calling class. Used to make testing easier. To define dependencies for classes, edit the di.xml configuration file.</p>"}},{"node":{"frontmatter":{"title":"double opt-in","wordClasses":["noun","verb"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>An email verification process that requires potential subscribers to complete a second step that confirms their intention to subscribe.</p>"}},{"node":{"frontmatter":{"title":"dynamic media URL","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["content delivery network","URL"]},"html":"<p>A URL address that is generated dynamically by the system to reference an image or other media. The address links directly to assets stored on a server or a content delivery network.\nTo use a static URL, change the configuration setting. However, if dynamic media URLs are included in your catalog when you disable the setting, each reference in your catalog will become a broken link. Links can be restored by again enabling dynamic media URLs. Using dynamic media URLs can affect catalog search's performance.</p>\n<p>Code format: media url=\"path/to/image.jpg\"</p>"}},{"node":{"frontmatter":{"title":"entity attribute value","wordClasses":["noun"],"tags":["Programming"],"synonyms":["EAV"],"relatedTerms":null},"html":"<p>For database entities, a data model that efficiently encodes entities. Stores the entity id, attribute name, and value as a triple, which allows new entity attribute names to be created at any time. In encoding, the number of attributes that can be used to describe entities can scale extensively, but the number that applies to a given entity is minimized. This data model is very flexible, but can be slow.</p>"}},{"node":{"frontmatter":{"title":"event","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A user action or other occurrence that is detected by the system and triggers a response. Interactive experiences are made possible by events that change the program flow. Software typically incorporates event loops or other dedicated event handlers to identify and manage events.</p>"}},{"node":{"frontmatter":{"title":"evergreen content","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>Content that has a long shelf life, or that can be reused.</p>"}},{"node":{"frontmatter":{"title":"exception handler","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A software mechanism that manages the response to an exception. The manner in which an exception is handled might change the program flow and require specialized programming.</p>"}},{"node":{"frontmatter":{"title":"exception","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>An abnormal condition that requires special processing.</p>"}},{"node":{"frontmatter":{"title":"framework","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["module"]},"html":"<p>A software framework is a foundation of defined code in which more code can be added to fully customize or build out the software. </p>\n<p>In the Magento framework, parts of the software leverage Zend, an open-source, object-oriented PHP framework. Modules are built using the Magento framework.\nFrameworks can be used for developing software applications, products and solutions (combinations of products and services). To integrate different components, development can include integration of APIs, code libraries, compilers, support programs and other toolsets.</p>\n<p>Unlike libraries, frameworks feature the following:</p>\n<p>• flow of control dictated by the framework, not the caller\n• a default behavior that is user-centric and logical\n• extensibility, enabling users to more easily build an application</p>"}},{"node":{"frontmatter":{"title":"freight on board","wordClasses":["noun"],"tags":["Business / Marketing","Order","Pricing"],"synonyms":["FOB"],"relatedTerms":null},"html":"<p>In international shipping, this term means that the receiving party is responsible for the shipping charges. FOB can be based on the place of origin or destination, and be designated as either freight collect or freight prepaid.</p>"}},{"node":{"frontmatter":{"title":"fulfillment","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The process of managing customer shipments.</p>"}},{"node":{"frontmatter":{"title":"gross margin","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The difference between the cost and price of a product.</p>"}},{"node":{"frontmatter":{"title":"handle","wordClasses":["noun"],"tags":["Programming"],"synonyms":["page handle"],"relatedTerms":null},"html":"<p>Generally, a handle is a way to reference an object. In Magento, handles are used in many places, most commonly to identify a page. For page handles, the handle name is derived from the URL, then used to locate and load the layout files for the referenced page.\nFor example, in the Magento Customer module, there is a layout file called “view/frontend/layout/checkout<em>cart</em>index.xml”. Here “frontend” is the area name and “checkout<em>cart</em>index” is the handle name, both of which are derived from the URL.</p>"}},{"node":{"frontmatter":{"title":"integration API","wordClasses":["noun"],"tags":["Programming"],"synonyms":["API","web API"],"relatedTerms":["API"]},"html":"<p>An API endpoint that can be used by third-party applications to access a particular device.</p>"}},{"node":{"frontmatter":{"title":"interception","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["plug-in"]},"html":"<p>The process of injecting new code before, after, or around an existing public function of a PHP class. </p>\n<p>To intercept a function, a plug-in implements the additional code to be invoked. Plug-ins are associated with interception points by the dependency injection configuration file (di.xml). If multiple plug-ins are defined on the same function, the dependency injection configuration defines the order in which the plug-ins are invoked, allowing multiple plug-ins to be used without conflict.</p>"}},{"node":{"frontmatter":{"title":"invoice item","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["invoice"]},"html":"<p>A purchased item in an invoice.</p>"}},{"node":{"frontmatter":{"title":"invoice comment","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["invoice"]},"html":"<p>Details the invoice history.</p>"}},{"node":{"frontmatter":{"title":"invoice","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["quote"]},"html":"<p>A document that provides a detailed description of a purchase, including products purchased, quantity, price, shipping cost, sales tax, and total. If the products in an order are shipped in multiple shipments, then an invoice is generated for each shipment for the products in that shipment.</p>"}},{"node":{"frontmatter":{"title":"language package","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Magento component","package"]},"html":"<p>Provides translation dictionaries used to localize the Magento application. A language package includes one or more translation files. A package is a one of the components in Magento, which also include modules and themes.</p>"}},{"node":{"frontmatter":{"title":"link juice","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>(Slang) The value and authority transferred from one web page to another via hyperlinks (or links). Link juice affects a website’s page rank, a factor used to rank a search engine results page.</p>"}},{"node":{"frontmatter":{"title":"load sequence","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["module"]},"html":"<p>The order in which scripts are loaded into memory. Used for modules. To work correctly, some scripts must be loaded before others.</p>"}},{"node":{"frontmatter":{"title":"Magento Admin","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["Admin","Admin Panel","backend","Administration Interface","Admin UI"],"relatedTerms":["admin"]},"html":"<p>The password-protected back office of your store where orders, catalog, content, and configurations are managed. Users access the Magento Admin to manage the store, including products, orders, shipments, CMS content, design of the storefront, customer information, etc. Magento users have an associated role with permissions that controls access to features, options, and capabilities. </p>"}},{"node":{"frontmatter":{"title":"locale","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A set of configurations that defines the user’s language, country, tax rate, and other settings. Example: \"en_US\".</p>"}},{"node":{"frontmatter":{"title":"markdown","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The amount subtracted from the original price of a product.</p>"}},{"node":{"frontmatter":{"title":"markup","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>Multiple definitions include:\n• In marketing and retail, a percentage added to the cost of an item to determine the retail price.\n• In development, a computer language that controls the processing, presentation, and formatting of text. Also, markup tags are snippets of code that add functionality or content to a CMS page or block.</p>"}},{"node":{"frontmatter":{"title":"media storage","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A dedicated space, which can be included on the content delivery network, for your media assets.</p>"}},{"node":{"frontmatter":{"title":"merchant account","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>An account with a bank or financial institution that makes it possible to accept credit card transactions.</p>"}},{"node":{"frontmatter":{"title":"metapackage","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Composer types","package"]},"html":"<p>An empty package that contains requirements and will trigger their installation, but neither contains files nor writes anything to the filesystem. No dist or source key is required for installation.</p>"}},{"node":{"frontmatter":{"title":"mixin","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Less","Magento UI Library","UI Component"]},"html":"<p>A class that contains a combination of methods from other classes. Mixins encourage code reuse and can be used to avoid the inheritance ambiguity that multiple inheritance can cause (the diamond problem), or to work around lack of support for multiple inheritance in a language.\nHow such a combination is done depends on the language, but it is not by inheritance. If a combination contains all methods of combined classes it is equivalent to multiple inheritance.</p>\n<p>Magento UI components, a Less frontend library, use a set of mixins for base elements to ease frontend theme development and customization.</p>"}},{"node":{"frontmatter":{"title":"namespace","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["PHP"]},"html":"<p>A set of symbols used to organize a variety of objects so that the objects may be referred to with a name. </p>\n<p>In PHP, a namespace determines where a PHP file is located within the namespace hierarchy. The same class name can be reused, but a namespace provides differentiation between files.</p>"}},{"node":{"frontmatter":{"title":"Naxsi","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Nginx"]},"html":"<p>An open-source web application firewall (WAF) for Nginx.</p>"}},{"node":{"frontmatter":{"title":"Nginx","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Naxsi"]},"html":"<p>(Pronounced \"engine x\") A free, open-source software that functions as a web server or a reverse proxy (for TCP, UDP, HTTP, HTTPS, SMTP, POP3, and IMAP protocols), as well as a load balancer and an HTTP cache.</p>"}},{"node":{"frontmatter":{"title":"opt-in","wordClasses":["noun","adjective","verb"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The process by which a user consents to receive messages and promotional material, usually through email.</p>"}},{"node":{"frontmatter":{"title":"order status","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["order","invoice"]},"html":"<p>Indicates the relative position and state of a customer order in a workflow. Basic stages of the workflow include Order, Payment, Invoice, and Shipment.\nThe full breakdown of order statuses includes:\n• Pending - For new orders that have not been processed. Typically, these orders need to be invoiced and shipped.\n• On Hold - Order can't proceed to order processing in this state. This is used when, for example, some data must be verified.\n• Pending PayPal - For new orders placed through PayPal that are not yet cleared. When paying with PayPal, customers are redirected to the PayPal website. If customers haven't paid, order status is \"Pending PayPal\". These orders shouldn't be processed without checking PayPal to confirm that payment is made.\n• Payment Review - When an external payment gateway is verifying the payment information from a sales order, the order is assigned the Payment Review status in the payment system and in Magento.\n• Processing - Means the order has been invoiced or shipped, but not both.\n• Suspected Fraud (possible for PayPal orders only) – The order transaction did not pass one or more of the PayPal fraud filters, and the system receives a response from PayPal that Fraud Services is reviewing the transaction.</p>\n<ul>\n<li>Complete - Orders marked as complete have been fully invoiced and shipped.\n• Canceled - When the customer calls your web store and asks to cancel an order, if payment has not been made for the order.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"order","wordClasses":["noun","verb"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["order status","invoice"]},"html":"<p>When a customer places an order during checkout, Magento creates a \"sales order\" that is a temporary record of the request. The status of the order is \"pending\" because payment has not been processed, and the order has not yet been invoiced.</p>"}},{"node":{"frontmatter":{"title":"package","wordClasses":["verb"],"tags":["Programming"],"synonyms":[],"relatedTerms":["Composer package","language package","meta package"]},"html":"<p>The process of creating a distributable module for Magento Marketplace or another distribution system.</p>"}},{"node":{"frontmatter":{"title":"packing slip","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A document usually included in a shipped package that describes the contents. Packing slips do not include financial or account information.</p>"}},{"node":{"frontmatter":{"title":"path to purchase","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>The path a prospect follows that leads to a sale.</p>"}},{"node":{"frontmatter":{"title":"Payment Card Industry","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":["PCI"],"relatedTerms":null},"html":"<p>Refers to debit and credit cards and their associated businesses.</p>"}},{"node":{"frontmatter":{"title":"payment gateway","wordClasses":["noun"],"tags":["Business / Marketing","Order","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A payment gateway is a third-party service that seamlessly processes credit card transactions without the customer leaving the merchant's site.</p>"}},{"node":{"frontmatter":{"title":"Payment Method","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A way for the customer to pay for merchandise. Payment methods can be internal or external. </p>\n<p>The Payment Methods section of the System Configuration includes all basic payment methods and gateways.</p>"}},{"node":{"frontmatter":{"title":"payments as a service","wordClasses":["noun"],"tags":["Business / Marketing","Order","Programming"],"synonyms":[],"relatedTerms":["cloud services","platform as a service","software as a service"]},"html":"<p>A software as a service that connects international payment systems. It uses its own standard APIs and functions as a layer on top of the systems, enabling two-way communication between a system and the payments as a service software.</p>"}},{"node":{"frontmatter":{"title":"PHP","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["backend","HTML"]},"html":"<p>An open-source, server-side (backend) scripting language designed mainly for web development. The script is embedded within a Web page’s HTML. When a user has requested the page, the Web server calls PHP to read the script and perform its operation.</p>\n<p>PHP pages typically have file name suffixes that include: \".php\" \".php3,\" or \".phtml\". PHP pages are dynamic, driven by the how the script is read.</p>"}},{"node":{"frontmatter":{"title":"PHTML","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["HTML","PHP"]},"html":"<p>An HTML page including PHP script.</p>"}},{"node":{"frontmatter":{"title":"platform as a service","wordClasses":["noun"],"tags":["Programming"],"synonyms":["PaaS"],"relatedTerms":["cloud services","payments as a service","software as a service"]},"html":"<p>A platform — used by Magento Cloud — that features cloud computing services that enable the development and management of applications. </p>\n<p>PaaS doesn't require customers to buy and manage infrastructure, including hardware, software, network, servers operating systems and storage. Customers can control running applications and, in some cases, the application-hosting configuration settings. “PaaS” can be used on second reference.</p>"}},{"node":{"frontmatter":{"title":"prefork","wordClasses":["verb"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>To split a process in advance, so similar processes are immediately available later, if required.</p>"}},{"node":{"frontmatter":{"title":"privacy policy","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>A document that explains the merchant’s policies for handling customer information.</p>"}},{"node":{"frontmatter":{"title":"purchase order (PO)","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["invoice"]},"html":"<p>A payment method that allows commercial customers to make purchases with prior authorization.  During checkout, the customer references the PO number as the method of payment.  An invoice is sent and processed through the company's accounts payable system.</p>"}},{"node":{"frontmatter":{"title":"publisher, subscriber pattern","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Where one or more \"publishers\" can send a message on a message bus without knowing who is interested in the message. Subscribers can listen to the message by \"subscribing\". The pattern is normally used as a one-to-many broadcast of messages, but it can be used as many-to-many, if appropriate.</p>"}},{"node":{"frontmatter":{"title":"quote","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":["invoice"]},"html":"<p>A pricing document that a company uses to show a customer how much an order will cost, including a breakdown of elements that affect the cost.</p>"}},{"node":{"frontmatter":{"title":"related product","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":null},"html":"<p>A selection of products that is presented as an incentive to purchase additional items. For example, if the customer is viewing the product page for a camera, the related products might include other comparable cameras, a camera case, and tripod.</p>"}},{"node":{"frontmatter":{"title":"relative link","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":null},"html":"<p>A hyperlink that includes only the address of the linked page that is relative to the linking page, rather than the full URL. </p>\n<p>A relative link needs the full URL of the current page to be resolved. Web browsers resolve relative links into full links before sending to a web server. Relative links frequently are used to reference web assets located in the same directory as the current asset. (Example: \"style.css\" is a relative link.)</p>"}},{"node":{"frontmatter":{"title":"release candidate","wordClasses":["noun"],"tags":["Magento Software","Programming"],"synonyms":["beta version","RC"],"relatedTerms":null},"html":"<p>A type of beta version that is almost ready to become finalized, unless significant bugs emerge. The Magento community is encouraged to provide feedback and Pull Requests (PR) in GitHub to fix errors in code, design, and documentation.</p>"}},{"node":{"frontmatter":{"title":"return policy","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A document that explains the merchant’s rules regarding the return of products by customers.</p>"}},{"node":{"frontmatter":{"title":"sales rules","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["cart rule","catalog rule"]},"html":"<p>Includes cart and catalog rules, which used to price a product for promotions.</p>"}},{"node":{"frontmatter":{"title":"scope","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":null},"html":"<p>In Magento, scope describes the extent of your store hierarchy that a setting can affect. Scope can apply to the following:\n• Global — all websites, stores, and store views\n• Website — the selected website and all stores and store views under it\n• Store — the selected store and all store views under it\n• Store View — the selected store view.\nWithin the hierarchy, settings applied at a lower level can override some higher-level settings.</p>"}},{"node":{"frontmatter":{"title":"search engine optimization","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":["SEO"],"relatedTerms":["keyword"]},"html":"<p>The process of improving a website’s search engine rankings in order to increase valued visitors.</p>"}},{"node":{"frontmatter":{"title":"security certificate","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A tool which securely validates and encrypts data that travels both ways between the browser (client) and server. Sites with a security certificate use the “HTTPS” protocol, displayed in the web address bar. SSL is the standard certificate.</p>"}},{"node":{"frontmatter":{"title":"security code","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":["card security code","CSC","CVN","CVV","CCV","CVC"],"relatedTerms":null},"html":"<p>A 3- or 4-digit number that provides an additional level of security for credit cards and online transactions. May be found on the back or front of the card.</p>"}},{"node":{"frontmatter":{"title":"server side","wordClasses":["noun"],"tags":["Programming"],"synonyms":["backend"],"relatedTerms":["backend","cache backend","frontend"]},"html":"<p>In a client-server application, backend code runs on a server. The frontend component, or client, is an interface on a local computer or workstation that and enables users to access the remote server and manipulate the backend code. A user cannot directly access backend code.</p>\n<p>In Magento, customers interact with the storefront (UI), merchants interact with the Magento Admin (front end client / browser). These interactions launch the server-side \"backend\" code, or Magento application programs, remotely.</p>"}},{"node":{"frontmatter":{"title":"service contract","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["PHP","web API"]},"html":"<p>A set of PHP interfaces that are defined for a module. A service contract includes data interfaces, which preserve data integrity, and service interfaces, which hide business logic details from service requestors such as controllers, web services, and other modules. Web APIs can be bound to service contracts via configuration files.</p>"}},{"node":{"frontmatter":{"title":"settlement","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>Settlement occurs when the acquiring bank and the issuer exchange funds and the proceeds are deposited into the merchant account.</p>"}},{"node":{"frontmatter":{"title":"Shared Catalog","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["Catalog"]},"html":"<p>A feature that allows merchants to create a catalog that can serve as their entire catalog or a subset of it, and then assign custom prices for one or more products. Merchants can then assign this catalog to one or more companies.</p>\n<p>For example, a B2B merchant has three customers who’ve negotiated specific rates for his electronics distribution site. Using the shared catalog feature, the merchant has:\n• a main catalog\n• a customer 1 catalog (perhaps it’s just three SKUs with heavy discounts on them from the main catalog)\n• customer 2 catalog (could be the entire catalog with 10% off)\n• customer 3 catalog (a few dozen products with discounts off the main catalog ranging from 5% - 60%).</p>"}},{"node":{"frontmatter":{"title":"shipment document","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A document that accompanies a shipment. The document lists the products and their quantities in the delivery package.</p>"}},{"node":{"frontmatter":{"title":"shipment","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A shipment contains products to be delivered and generates a record of the products in an order that have been shipped. More than one shipment can be associated with a single order.</p>"}},{"node":{"frontmatter":{"title":"shipping carrier","wordClasses":["noun"],"tags":["Business / Marketing","Order"],"synonyms":[],"relatedTerms":null},"html":"<p>A company that transports packages. Common carriers include UPS, FedEx, DHL, and USPS.</p>"}},{"node":{"frontmatter":{"title":"simple product","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>This is the most basic product type, a physical item with a single SKU. Simple products have a variety of pricing and of input controls which makes it possible to sell variations of the product. Simple products can be used in association with grouped, bundle, and configurable products. A simple product with custom options is sometimes referred to as a composite product.</p>"}},{"node":{"frontmatter":{"title":"software as a service","wordClasses":["noun"],"tags":["Programming"],"synonyms":["SaaS"],"relatedTerms":["cloud services","payments as a service","platform as a service"]},"html":"<p>A software delivery model where the vendor provides the software and hosting environment, and customers pay for the service by subscription or per use.</p>"}},{"node":{"frontmatter":{"title":"SKU","wordClasses":["noun"],"tags":["Business / Marketing","Pricing","Product","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Abbreviation for Stock Keeping Unit. A number or code assigned to a product to identify the product, options, price, and manufacturer.</p>"}},{"node":{"frontmatter":{"title":"static block","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":["CMS block","block"]},"html":"<p>A modular unit of content that can be placed by a user in the CMS on a page to display text and images, or execute snippets of code. Static blocks contain editable content and can act as landing pages for product categories. Widgets can be added to static blocks to provide additional functionality.</p>"}},{"node":{"frontmatter":{"title":"static page","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":["dynamic content"]},"html":"<p>A page with the main content area that is manually populated with content and is easier to cache. Does not use dynamic content.</p>"}},{"node":{"frontmatter":{"title":"static files","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":["CSS","JavaScript"]},"html":"<p>The collection of assets, such as CSS, fonts, images, and JavaScript that is used by a theme.</p>"}},{"node":{"frontmatter":{"title":"store view","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["store","website"]},"html":"<p>The Magento scope level of \"store view\" refers to third level in the hierarchy of website(s), store(s) and store view(s).  Store views  typically present the storefront in a different locale and language. Use the store chooser in the header to change store views.</p>"}},{"node":{"frontmatter":{"title":"storefront","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":null},"html":"<p>The online store that customers experience when they visit your Magento site.</p>"}},{"node":{"frontmatter":{"title":"store","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["store view","website"]},"html":"<p>The Magento scope level of \"store\" is the second level of your website's hierarchy, which goes as follows: websites(s) > store(s) > store view(s). Stores can be organized into one or many. Each store, potentially, has its own root category, and all share the same catalog and customer data. </p>\n<p>Each store can have multiple store views, which are typically used to present the storefront in a different locale and language.</p>"}},{"node":{"frontmatter":{"title":"tax rule","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>A combination of a product tax class, customer tax class, and tax rate. This rule defines which tax calculation is applied.</p>"}},{"node":{"frontmatter":{"title":"template","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":["block"]},"html":"<p>Short for HTML template or PHTML template. A PHTML file contains a mixture of HTML markup and PHP code to inject dynamic content into the HTML. Most blocks have at least one PHTML (template) file that contains the static HTML generated by the block.\nIn the Admin, email and newsletter templates combine text, images, and variables with HTML markup to produce personalized content that is sent by the system.</p>"}},{"node":{"frontmatter":{"title":"theme","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":null},"html":"<p>Contains graphics and appearance information. Customizes the look and feel of the store.\nMagento can ship themes in (Composer) packages. But themes can be placed under app / design, which are not shipped in a package. Packages are the unit of download for Composer, and — via Magento Marketplace — Magento users can download CE or EE as a series of packages, where packages contain modules, themes, or language packs.</p>"}},{"node":{"frontmatter":{"title":"third-party library","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["library"]},"html":"<p>An external set of code developed by a third-party developer or partner.</p>"}},{"node":{"frontmatter":{"title":"transactional email","wordClasses":["noun"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":null},"html":"<p>Transactional email is a legal term that defines automated messages which are sent to customers in response to a specific event or transaction.</p>"}},{"node":{"frontmatter":{"title":"translation file","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["CSV"]},"html":"<p>Comma-separated value (CSV) message catalog files that provide translations for strings displayed in Magento.</p>"}},{"node":{"frontmatter":{"title":"unit","wordClasses":["noun"],"tags":["Magento Software"],"synonyms":[],"relatedTerms":null},"html":"<p>Each standalone on-demand part of a larger course is called a unit.</p>"}},{"node":{"frontmatter":{"title":"upsell","wordClasses":["noun","verb"],"tags":["Business / Marketing"],"synonyms":[],"relatedTerms":["cross-sell","related products"]},"html":"<p>An upsell item is one that is offered to the customer as an alternative to the product the customer is viewing. These products may be more expensive, of higher quality, or more popular, or produce a higher profit margin.</p>"}},{"node":{"frontmatter":{"title":"virtual product","wordClasses":["noun"],"tags":["Magento Software","Product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>Represents a non-physical product that can be sold, such as a membership, service, warranty, or subscription. Virtual products can be sold individually, or included as part of the following product types: grouped product and bundle product. Does not require shipping or inventory. </p>\n<p>The process of creating a virtual product and a simple product is nearly the same. However, because a virtual product is not shipped, there is no Weight field or option to include a gift card.</p>"}},{"node":{"frontmatter":{"title":"virtual type","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["PHP"]},"html":"<p>Virtual types are a way to inject different dependencies into existing PHP classes without affecting other classes and without having to create a new class file. Virtual types can only be referenced in by argument overrides in a <type> element within di.xml files, never in source code. They can't be extended and they can't be references as dependencies in a classes constructor.</p>"}},{"node":{"frontmatter":{"title":"web API","wordClasses":["noun"],"tags":["Programming"],"synonyms":[],"relatedTerms":["API"]},"html":"<p>An application programming interface (API) for a web server or browser, usually limited to the client side.</p>"}},{"node":{"frontmatter":{"title":"widget","wordClasses":["noun"],"tags":["Business / Marketing","Magento Software"],"synonyms":[],"relatedTerms":["block"]},"html":"<p>A widget is a prepared snippet of code that can be used to place blocks, links, and dynamic content at specific locations on store pages.</p>"}},{"node":{"frontmatter":{"title":"whitelist","wordClasses":["noun","verb"],"tags":[null],"synonyms":[],"relatedTerms":["blacklist"]},"html":"<p>A method of filtering data that allows only the data specified on a list and nothing else.</p>"}},{"node":{"frontmatter":{"title":"XML","wordClasses":["noun"],"tags":["Programming"],"synonyms":["Extensible Markup Language"],"relatedTerms":null},"html":"<p>Abbreviation for \"Extensible Markup Language\". A markup format derived from SGML that is used to format information for publication and distribution.</p>"}},{"node":{"frontmatter":{"title":"admin","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["administrator","super user"],"relatedTerms":["magento-admin"]},"html":"<p>In software, a user role with full administrator privileges to manage all functionality. In Magento, admin users have full permissions and access to all features, options, and capabilities in the Magento Admin. They can also create users and roles.</p>"}},{"node":{"frontmatter":{"title":"API","wordClasses":["noun"],"tags":["programming"],"synonyms":["application programming","interface","integration API","web API"],"relatedTerms":["web API","integration API","service contract"]},"html":"<p>Abbreviation for application program interface. A software interface that lets third-party applications read and write to a system using programming language constructs or statements. Magento supports and provides <a href=\"https://devdocs.magento.com/guides/v2.3/get-started/rest_front.html\">REST</a> and <a href=\"https://devdocs.magento.com/guides/v2.3/get-started/soap/soap-web-api-calls.html\">SOAP</a>.</p>"}},{"node":{"frontmatter":{"title":"aspect ratio","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>The proportional relationship between the width and height of an image. </p>"}},{"node":{"frontmatter":{"title":"attribute group","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>A logical grouping of attributes within an attribute set.</p>"}},{"node":{"frontmatter":{"title":"attribute set","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>A collection of attribute groups, customized for a specific product. Example: A T-shirt attribute set might include color, size, gender, and brand.</p>"}},{"node":{"frontmatter":{"title":"attribute","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":["product attribute","custom attribute"],"relatedTerms":["extension attributes"]},"html":"<p>A characteristic or property of a product that describes some aspect of the product. Magento users can create custom attributes to add to the default attribute set or a custom attribute set. Create these attributes through the Magento Admin or programmatically. Examples: color, size, weight, price, age, gender, etc.</p>\n<p>Custom attributes are a type of Entity-Attribute-Value (EAV) attribute.</p>\n<p>For integrations like Google Shopping ads Channel and Amazon Sales Channel, you map Magento attributes to attributes in the third-party to properly display and sell products, display ads, etc.</p>"}},{"node":{"frontmatter":{"title":"authorization","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["capture"]},"html":"<p>To grant permission for a user or service to perform actions, or gain access to resources.</p>"}},{"node":{"frontmatter":{"title":"average inventory cost","wordClasses":["noun"],"tags":["product","pricing","inventory"],"synonyms":[],"relatedTerms":null},"html":"<p>Product price, less coupons or discounts, plus freight and applicable taxes. The average is determined by adding the beginning cost of inventory each month, plus the ending cost of inventory for the last month of the period.</p>"}},{"node":{"frontmatter":{"title":"B2B","wordClasses":["adjective"],"tags":["business"],"synonyms":[],"relatedTerms":["B2C"]},"html":"<p>An abbreviation for \"business to business.\" A type of business transaction between two business entities that are not the final consumers of the goods or services.</p>"}},{"node":{"frontmatter":{"title":"B2C","wordClasses":["adjective"],"tags":["business"],"synonyms":[],"relatedTerms":["B2B"]},"html":"<p>Abbreviation for \"business to consumer.\" Business transactions between a business entity and a consumer. Magento Open Source and Magento Commerce provide features to create stores for selling between a business and customers. Selling from a business to another business is B2B.</p>"}},{"node":{"frontmatter":{"title":"banner","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Promotional graphics that appear either horizontally on the top of a web page or vertically on the left or right margins. Website advertisements often appear as banners.</p>"}},{"node":{"frontmatter":{"title":"block","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["CMS block","static block","container","layout"]},"html":"<p>A unit of page output that renders some distinctive content – a piece of information, a user interface element – anything visually tangible for the end-user. Blocks are implemented and provided by modules. Blocks use templates to generate HTML. Examples of blocks include a category list, a mini cart, product tags, and product listing.</p>"}},{"node":{"frontmatter":{"title":"breadcrumb","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A navigation aid that helps users to keep track of their location within your store. Breadcrumbs generally appearin a horizontal array at the top of a page, including links that take users to higher levels of site categorization.</p>"}},{"node":{"frontmatter":{"title":"broken link","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A hyperlink with an invalid address that fails to send the user to its intended web page. A user who clicks a broken link generally lands on an error (404) page.</p>"}},{"node":{"frontmatter":{"title":"bundle product","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":["simple product","virtual product","product types"]},"html":"<p>Lets customers assemble a \"build your own\" customizable product from a variety of options and configurations. Each item in the bundle is either a separate simple or virtual product.</p>"}},{"node":{"frontmatter":{"title":"cart rules","wordClasses":["noun"],"tags":["magento-software","Pricing","Product"],"synonyms":[],"relatedTerms":["catalog rule","shopping cart"]},"html":"<p>Price rules which are applied to the shopping cart, and trigger an action in response to a set of conditions. Used to create promotions.</p>"}},{"node":{"frontmatter":{"title":"catalog rules","wordClasses":["noun"],"tags":["magento-software","Pricing","Product"],"synonyms":[],"relatedTerms":["cart rule","Catalog"]},"html":"<p>Price rules which are applied to specific product(s), and trigger an action in response to a set of conditions. Used to create promotions.</p>"}},{"node":{"frontmatter":{"title":"Catalog","wordClasses":["noun"],"tags":["magento-software","Pricing","Product"],"synonyms":[],"relatedTerms":["Shared Catalog","catalog rule"]},"html":"<p>For merchants, the catalog represents their product inventory. Within Magento’s architecture, the catalog consists of categories, products, and product attributes.</p>\n<p>Each Magento store has only one product catalog, which is shared by all store views. In a multi-store installation, each store can have a separate catalog, or share the same catalog.\nThe current store catalog is determined by the default root category, visible to the user in the top navigation (main menu) of the store. (The term \"root category\"  may be confusing, because the \"root category\" isn't really a category at all, but a container for the menu, which consists of categories and sub-categories.)</p>\n<p>You can create as many root categories as you want, but only one (the default) can be used at a time.</p>"}},{"node":{"frontmatter":{"title":"category","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":null},"html":"<p>A group of products that have something in common. The main menu of the store is organized into categories and subcategories of products.</p>"}},{"node":{"frontmatter":{"title":"checkout","wordClasses":["noun"],"tags":["Business / Marketing","design","Order","Product","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>The process of gathering the payment and shipping information that is necessary to complete the purchase of items in the shopping cart. After the customer reviews the information and submits the order, an email confirmation is sent to the customer.</p>"}},{"node":{"frontmatter":{"title":"configurable product","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A configurable product looks like a single product with drop-down lists of options for each variation. Each option is actually a separate simple product with a unique SKU, which makes it possible to track inventory for each product variation.\nTo achieve a similar effect, a simple product can be used with custom options, but without the ability to track inventory for each variation. Products with multiple options are sometimes referred to as composite product.</p>\n<p>Although a configurable product uses more SKUs, and may initially take a little longer to set up, it can save you time in the long run. If you plan to grow your business, the configurable product type might be a better choice for a product with multiple options.</p>\n<p>Example: T-shirts that can be bought with two colors and three sizes. Six variants need to be created as individual products (each with its own SKU). Then, all variants are added to a configurable product where customers can choose the size and color, and then add it to their cart.</p>"}},{"node":{"frontmatter":{"title":"CMS block","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["block","static block"]},"html":"<p>A special variant of block that can only be created in the Magento Admin and can't be referenced through layout files.</p>"}},{"node":{"frontmatter":{"title":"container","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["layout","block","UI component","HTML","CSS"]},"html":"<p>A type of node in a layout tree (along with blocks and UI components), a container is a defined region on a page that generates HTML (composed as an array of variable items in an ordered list) with CSS attributes. </p>\n<p>The attributes of a container include visibility, horizontal and vertical alignment, autoresizing, edibility, position, and size.</p>"}},{"node":{"frontmatter":{"title":"CSS","wordClasses":["noun"],"tags":["design"],"synonyms":["Cascading Style Sheets"],"relatedTerms":["HTML"]},"html":"<p>Abbreviation for Cascading Style Sheets. A code language that controls the appearance of HTML documents. CSS controls the appearance of text, graphics, lists, links, and all other elements on a web page.</p>"}},{"node":{"frontmatter":{"title":"design pattern","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A repeatable and reusable solution to a common design problem. Guides how UI components are built and how they should be used.</p>"}},{"node":{"frontmatter":{"title":"Docker","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>An installation tool that automatically deploys Magento software into a local environment, creating a pre-built environment that can be installed on Mac or Windows. When installation is complete, the “Docker container” will run on Linux, including the Magento 2 source code, an Apache web server, and a MySQL database server. The web server and database server have the Magento 2 Luma demo store pre-loaded.</p>"}},{"node":{"frontmatter":{"title":"domain","wordClasses":["noun"],"tags":["design"],"synonyms":["URL"],"relatedTerms":null},"html":"<p>An internet address, such as \"mystore.com.\"</p>"}},{"node":{"frontmatter":{"title":"downloadable product","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A digitally downloadable product that consists of one or more files that are downloaded, such as an eBook, music, video, software application, or an update. You can offer an album for sale and sell each song individually. A downloadable product can deliver an electronic version of your product catalog.</p>\n<p>Downloadable files can reside on your server or be provided as URLs to any other server or content delivery network.</p>"}},{"node":{"frontmatter":{"title":"dynamic content","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":["PHP"]},"html":"<p>Content that is generated by code rather than read from a static template. After dynamic content is initially rendered when a user visits a page, in some cases the content can be cached and reused without requiring another dynamic call upon a revisit.</p>"}},{"node":{"frontmatter":{"title":"extension attribute","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>Extend functionality and often use more complex data types than custom attributes. These attributes do not appear on the GUI.</p>"}},{"node":{"frontmatter":{"title":"entity","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute","cart rule","catalog rule"]},"html":"<p>A unique unit or object in programming. Contains attributes or parameters that can be modified. Examples include staging — where an update can change entities such as price rules, products or categories — and database records — where service contracts include data structures that are sent and received.</p>"}},{"node":{"frontmatter":{"title":"FAQ","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Abbreviation for Frequently Asked Questions. A page or section on a site that answers questions in response to actual user feedback.</p>"}},{"node":{"frontmatter":{"title":"extension","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Magento component","module","package"]},"html":"<p>Code that extends or customizes Magento behavior. You can optionally package and distribute an extension on Magento Marketplace or another extension distribution system. A Magento extension can include modules, themes, and language packs.</p>"}},{"node":{"frontmatter":{"title":"favicon","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>An icon that appears in the address bar of the browser, in bookmark lists, and as desktop shortcuts. Favicons typically reflect the website branding and are saved as ICO files that are 16x16 or 32x32 pixels square. Support for other file formats varies by browser.</p>"}},{"node":{"frontmatter":{"title":"feed reader","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Software that is used to read syndicated content from RSS feeds.</p>"}},{"node":{"frontmatter":{"title":"frontend developer","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":["HTML","CSS","JavaScript"]},"html":"<p>A developer who uses technologies such as HTML, CSS, and JavaScript to develop the user interface or presentation layer for an application.</p>"}},{"node":{"frontmatter":{"title":"fluid layout","wordClasses":["noun"],"tags":["design"],"synonyms":["liquid layout"],"relatedTerms":null},"html":"<p>A flexible approach to web design that specifies the size and position of elements as percentages rather than as exact measurements in pixels.</p>"}},{"node":{"frontmatter":{"title":"frontend properties","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Properties that determine the presentation and behavior of an attribute from the standpoint of the customer in your store.</p>"}},{"node":{"frontmatter":{"title":"frontend","wordClasses":["adjective"],"tags":["design","Programming"],"synonyms":["client side"],"relatedTerms":["backend","storefront","cache frontend"]},"html":"<p>In a client-server application, there is the backend and frontend. The frontend component, or client, is an interface that enables users to manipulate or interact with the underlying backend code. Backend code runs on a server. A user cannot directly access backend code. A user interacts with the storefront, which in turn uses code running on the Magento server.\nNote: In the past, the Magento storefront has been referred to as the \"frontend\", and the Magento Admin has been referred to as the \"backend\". This usage is no longer supported.</p>"}},{"node":{"frontmatter":{"title":"gift card","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A prepaid card or or gift certificate that can be used to make purchases in the store. Each gift card is assigned a unique code which is entered at checkout. The value of the gift card is reflected in the gift card account balance. There are three types of gift cards: </p>\n<p>• \"Physical\" gift cards can be produced from plastic or card stock, shipped to the customer.\n• \"Virtual\" gift cards are sent by email.\n• \"Combined\" gift cards are a combination of the two, shipped to the recipient as a physical card and also delivered by email.\nGift cards are configurable, including options for product eligibility and selection of open or fixed amounts.</p>\n<p>A gift card can also be redeemed by the store administrator on customer request when the order is being created in the backend.</p>\n<p>Gift cards also help promotions, as store administrators can manually create the gift card accounts in the backend and send the gift card codes to the specific customer segment. Gift cards can serve as a loyalty program targeted at the most active customers who make a lot of purchases from the web store or a specific promotional campaign during the holidays.</p>"}},{"node":{"frontmatter":{"title":"grouped product","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":["simple product","product types"]},"html":"<p>A product type with several similar, standalone products grouped on a single page.  Can be offered with variations of a single product or by grouping them by season or theme to create a coordinated set. Each product can be purchased separately, or as part of the group.</p>\n<p>For example, for a knife that's available in four sizes, all four knives can be displayed within a grouped product page. Customers can select the sizes they want and add them to the cart from this page.</p>"}},{"node":{"frontmatter":{"title":"home page","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>The first home page that visitors see when they access your website's URL. Considered the most important page on your website according to search engine indexing.</p>"}},{"node":{"frontmatter":{"title":"JavaScript","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":["HTML","UI component"]},"html":"<p>A scripting language that can be used with HTML to produce dynamic effects and interactions on web pages.</p>"}},{"node":{"frontmatter":{"title":"HTML","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":["HyperText Markup Language"],"relatedTerms":["CSS"]},"html":"<p>Abbreviation for \"HyperText Markup Language\". A coding language with tags that identify and structure text, images, videos, and other media on a web page.</p>"}},{"node":{"frontmatter":{"title":"jQuery","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":["JavaScript"]},"html":"<p>A popular JavaScript library often used to create dynamic and responsive effects.</p>"}},{"node":{"frontmatter":{"title":"keyword","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":["search engine optimization"]},"html":"<p>A term or phrase used in a search to filter for content that is of significant importance to that term or phrase.</p>"}},{"node":{"frontmatter":{"title":"landing page","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A page on your site where a visitor arrives after clicking a link or advertisement. Landing pages can be unique pages devoted to a special campaign or an existing site page that can be customized to accommodate a special campaign.</p>"}},{"node":{"frontmatter":{"title":"layout instructions","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":["layout","block","containers","UI components"]},"html":"<p>Markup in a layout file that describes changes to be applied to a structured element tree of blocks, containers, and UI components. A single layout file can contain multiple layout instructions. Layout instructions are encoded in XML in layout files.</p>"}},{"node":{"frontmatter":{"title":"layout update","wordClasses":["noun"],"tags":["design","magento-software"],"synonyms":[],"relatedTerms":["layout update examples"]},"html":"<p>Used for snippets of code that that are added to modify the XML layout or to import the layout instructions from another file.</p>"}},{"node":{"frontmatter":{"title":"layout","wordClasses":["noun"],"tags":["design","magento-software"],"synonyms":[],"relatedTerms":["layout instructions","block"]},"html":"<p>In the construction of a Magento page, a layout is a series of blocks assembled in a hierarchy, representing the structure of the page. </p>\n<p>Page layout files focus on the highest level of page structure (header, footer, main content area, left sidebar, etc.). Layout files then assemble content (blocks) into these different areas on the page.</p>"}},{"node":{"frontmatter":{"title":"Less","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":["LESS"],"relatedTerms":["CSS","HTML"]},"html":"<p>Stands for \"Leaner CSS\". Simply put, Less combines CSS language (which applies visual styles to HTML pages) with other items - embedded variables, mixins, functions, and other features. </p>\n<p>This combination enables CSS to be themed and more maintainable and extendable. As a pre-processor, Less processes and exports its code into a standard CSS file that browsers can read and render into web pages.</p>"}},{"node":{"frontmatter":{"title":"library","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["third-party library"]},"html":"<p>In the Magento system, a logical grouping of functionality or related code within the framework layer. Magento includes its own framework libraries as well as third-party libraries within the software.</p>"}},{"node":{"frontmatter":{"title":"Magento compiler","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["compiler"],"relatedTerms":null},"html":"<p>Used to generate all auto-generated Magento code in advance. Improves performance of Magento by precompiling information used during runtime.</p>"}},{"node":{"frontmatter":{"title":"Magento component","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["component"],"relatedTerms":["UI component"]},"html":"<p>Used to refer to a module, theme, or language package in Magento.</p>"}},{"node":{"frontmatter":{"title":"Magento file system owner","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Overview of Ownerships and Permissions"]},"html":"<p>The user who owns files in the Magento file system. It’s very important to set up this user properly. Different hosting setups have different requirements.</p>"}},{"node":{"frontmatter":{"title":"Magento","wordClasses":["adjective"],"tags":["Business / Marketing","magento-software"],"synonyms":[],"relatedTerms":["Magento Trademark Requirements"]},"html":"<p>The company — its full name is \"Magento Commerce\" and legally is called \"Magento, Inc.\" — includes several products in the following categories: digital commerce, order management, and other industry solutions. The Magento term is a registered trademark and a company name.</p>"}},{"node":{"frontmatter":{"title":"meta tag","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":["metadata","keyword","HTML","search engine optimization"]},"html":"<p>Embedded but not visible in an HTML page, providing metadata about the page that is read by search engines and can be used in ranking search results. Meta tags can include page title, description and keywords.</p>"}},{"node":{"frontmatter":{"title":"metadata","wordClasses":["noun"],"tags":["Business / Marketing","design","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Data that describes other data. Metadata helps users find and work with data.</p>"}},{"node":{"frontmatter":{"title":"module (training)","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>The smaller sections within an on-demand course.</p>"}},{"node":{"frontmatter":{"title":"module","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Module Reference","Magento Module","PHP","XML","block"]},"html":"<p>Code that changes or extends features provided by the Magento application. A module is contained in a directory structure that contains PHP and XML files (configuration, blocks, controllers, helpers, models, and so on) related to a specific functionality to deliver a distinct collection of product features.\nThe purpose of each module is to provide specific product features by implementing new functionality or extending the functionality of other modules. Each module is designed to function independently, so the inclusion or exclusion of a particular module does not impact the functionality of other modules.</p>\n<p>A module can also implement widgets, which are page elements that can be customized by business users in the Admin .</p>\n<p>Modules can be disabled or removed without breaking the consistency of the Magento application. One exception: When the module depends on other modules, which requires disabling or removing the dependant modules.</p>"}},{"node":{"frontmatter":{"title":"navigation","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>The primary group of web page links in a user interface that a customer uses to navigate the website, finding information and functionality. The navigation links to the most important categories or pages on an online store. Navigation in the UI includes global navigation, footer navigation, local navigation, related links, utility navigation, breadcrumbs, and filters.</p>\n<p>The navigation of a typical Magento store includes the main menu at the top of each page, and the layered navigation in the left sidebar of some pages.</p>"}},{"node":{"frontmatter":{"title":"Page Builder","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["Admin","Admin Panel","backend","Administration Interface","Admin UI"],"relatedTerms":["admin"]},"html":"<p>Page Builder is a Magento extension for creating content-rich pages by dragging-and-dropping pre-built controls to define custom layouts.  We call these controls “content types.” Merchants can design layouts and pages without coding experience. Extension support is provided for developers to extend and programmatically work with Page Builder.</p>"}},{"node":{"frontmatter":{"title":"plug-in","wordClasses":["noun"],"tags":["design"],"synonyms":["plugin","add-in","addin","add-on","addon","or extension"],"relatedTerms":null},"html":"<p>A snippet of code that adds a feature or functionality to a store.  For example, a merchant might add a Facebook \"Like\" plug-in to a store.</p>"}},{"node":{"frontmatter":{"title":"product types","wordClasses":["noun"],"tags":["magento-software","Product"],"synonyms":[],"relatedTerms":null},"html":"<p>Magento classifies products as one of several predefined product types including simple product, virtual product, downloadable product, grouped product, configurable product, bundle product, and gift card.</p>"}},{"node":{"frontmatter":{"title":"robots.txt","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A file placed on a website that tells search-engine crawlers which pages not to index.</p>"}},{"node":{"frontmatter":{"title":"Sass","wordClasses":["noun"],"tags":["design","Programming"],"synonyms":[],"relatedTerms":["Compass","CSS"]},"html":"<p>Abbreviation for Syntactically Awesome Stylesheets.  A language that extends CSS — adding inline imports, mixins, nested rules, and variables — and keeps it well-organized with the assistance of the Compass style library.</p>"}},{"node":{"frontmatter":{"title":"shopping cart","wordClasses":["noun"],"tags":["Business / Marketing","design","Product","Programming"],"synonyms":["cart","basket"],"relatedTerms":["cart rule"]},"html":"<p>The set of products that a customer has selected to purchase, but has not yet purchased. Also refers to an area of an ecommerce site where these products can be found in order to review and checkout.</p>"}},{"node":{"frontmatter":{"title":"RSS feed","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Abbreviation for \"Really Simple Syndication\". A technology that creates web content syndication and allows web users to subscribe to product feeds, websites, and blogs. Allows clients to identify new content more efficiently. </p>\n<p>The Magento Admin user interface uses an RSS feed provided by Magento to receive alerts for available security patches and other important announcements.</p>"}},{"node":{"frontmatter":{"title":"sidebar","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":["layout"]},"html":"<p>The right or left column in a page that has a 2- or 3-column layout.</p>"}},{"node":{"frontmatter":{"title":"sign in, sign out","wordClasses":["noun","verb","adjective","noun","verb","adjective"],"tags":["design"],"synonyms":["login","log in","authenticate","authenticated","unauthenticated","logged in","logged out"],"relatedTerms":null},"html":"<p>The process of signing in to, and signing out of, an online account.</p>"}},{"node":{"frontmatter":{"title":"sitemap","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A page that serves as a directory of a websites’s content pages, usually categorized in a hierarchy. A sitemap can be accessed by users or search-engine crawlers, which use the information as a factor in weighing search results.</p>"}},{"node":{"frontmatter":{"title":"splash page","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>A promotional page with a product or advertisement; normally displayed before the home page.</p>"}},{"node":{"frontmatter":{"title":"static content","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":["dynamic content"]},"html":"<p>User-generated content, not generated by code, that does not change frequently.</p>"}},{"node":{"frontmatter":{"title":"UI component","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["JavaScript","DevDocs - UI Components Guide","layout","Magento component","Page Builder"]},"html":"<p>A tag designed for Magento 2 software to enable simpler and more flexible user interface (UI) rendering.\nThe goals of the UI component system include the following:</p>\n<ul>\n<li>Simplifying Layout Handle XML files</li>\n<li>Moving Magento Admin user interface elements from HTML+Javascript to a “pure javascript” custom widget system</li>\n<li>Enabling the creation of more complex UI components out of smaller components</li>\n<li>Pre-rendering data for UI components as JSON, binding closely to Magento backend data objects</li>\n<li>Using AJAX to update component data</li>\n<li>Introducing a new DSL for creating all of the above</li>\n</ul>"}},{"node":{"frontmatter":{"title":"URL","wordClasses":["noun"],"tags":["design"],"synonyms":["Uniform Resource Locator"],"relatedTerms":["canonical URL"]},"html":"<p>Abbreviation for \"Uniform Resource Locator\". The unique address of a page on the internet.</p>"}},{"node":{"frontmatter":{"title":"usability","wordClasses":["noun"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Refers to the degree to which a product or service is easy to use by its customers.</p>"}},{"node":{"frontmatter":{"title":"WYSIWYG","wordClasses":["adjective"],"tags":["design"],"synonyms":[],"relatedTerms":null},"html":"<p>Abbreviation for \"What You See Is What You Get\". A data-entry field with an editor that displays and formats images and textual content entered by users in a layout that closely matches how the content will be displayed when published.</p>"}},{"node":{"frontmatter":{"title":"website","wordClasses":["noun"],"tags":["Magento Software","design","Product"],"synonyms":[],"relatedTerms":["store","store view"]},"html":"<p>In Magento software, the highest level of a website hierarchy, above store and store view. You can have multiple websites, and each website can have a different domain name. Websites can be set up to share customer data, or to not share data.</p>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}