{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"admin","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["administrator","super user"],"relatedTerms":["magento-admin"]},"html":"<p>In software, a user role with full administrator privileges to manage all functionality. In Magento, admin users have full permissions and access to all features, options, and capabilities in the Magento Admin. They can also create users and roles.</p>","id":"c76beb03-34d2-5ee7-a911-12baa75a606c"}},{"node":{"frontmatter":{"title":"adminhtml","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["area","magento-admin"]},"html":"<p>The internal area name assigned to the Magento Admin.</p>","id":"100b256a-d771-5f75-9a34-f54a014c6dcc"}},{"node":{"frontmatter":{"title":"area","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["DevDocs - Modules and Areas","Magento component","storefront"]},"html":"<p>Area is an abstract term for a Magento application scope. Areas are logical components that organize code for optimized request processing. Areas reduce the memory demands of configuration objects accessed from the storefront, and they streamline web service calls by loading only the required dependent code. Each area can contain completely different code to process URLs and requests.</p>\n<p>Magento areas include:</p>\n<ul>\n<li>Magento Admin (adminhtml)</li>\n<li>Storefront (frontend)</li>\n<li>Web API REST (webapi_rest)</li>\n</ul>","id":"e87ef059-4c0e-579a-85f2-59bd153cd555"}},{"node":{"frontmatter":{"title":"attribute group","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>A logical grouping of attributes within an attribute set.</p>","id":"efb35551-83ad-50e5-8297-120abcda24dc"}},{"node":{"frontmatter":{"title":"attribute","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":["product attribute","custom attribute"],"relatedTerms":["extension attributes"]},"html":"<p>A characteristic or property of a product that describes some aspect of the product. Magento users can create custom attributes to add to the default attribute set or a custom attribute set. Create these attributes through the Magento Admin or programmatically. Examples: color, size, weight, price, age, gender, etc.</p>\n<p>Custom attributes are a type of Entity-Attribute-Value (EAV) attribute.</p>\n<p>For integrations like Google Shopping ads Channel and Amazon Sales Channel, you map Magento attributes to attributes in the third-party to properly display and sell products, display ads, etc.</p>","id":"b8c991bf-520d-5b98-a423-0d52f400f66c"}},{"node":{"frontmatter":{"title":"authorization","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["capture"]},"html":"<p>To grant permission for a user or service to perform actions, or gain access to resources.</p>","id":"4677f323-51b2-5437-b58e-47410c49d7b1"}},{"node":{"frontmatter":{"title":"attribute set","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>A collection of attribute groups, customized for a specific product. Example: A T-shirt attribute set might include color, size, gender, and brand.</p>","id":"f6dd9267-497e-5c4c-93d7-b203b9955a30"}},{"node":{"frontmatter":{"title":"block","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["CMS block","static block","container","layout"]},"html":"<p>A unit of page output that renders some distinctive content – a piece of information, a user interface element – anything visually tangible for the end-user. Blocks are implemented and provided by modules. Blocks use templates to generate HTML. Examples of blocks include a category list, a mini cart, product tags, and product listing.</p>","id":"de0f362c-4c6e-5d31-a4d7-b1963b9cb296"}},{"node":{"frontmatter":{"title":"bundle product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["simple product","virtual product","product types"]},"html":"<p>Lets customers assemble a \"build your own\" customizable product from a variety of options and configurations. Each item in the bundle is either a separate simple or virtual product.</p>","id":"8e0e5516-eaa2-598e-8812-d797cbb0c54c"}},{"node":{"frontmatter":{"title":"cart rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["catalog rule","shopping cart"]},"html":"<p>Price rules which are applied to the shopping cart, and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"26f4863e-6cb4-5f52-8f0b-607f4b2c1f4e"}},{"node":{"frontmatter":{"title":"Catalog","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["Shared Catalog","catalog rule"]},"html":"<p>For merchants, the catalog represents their product inventory. Within Magento’s architecture, the catalog consists of categories, products, and product attributes.</p>\n<p>Each Magento store has only one product catalog, which is shared by all store views. In a multi-store installation, each store can have a separate catalog, or share the same catalog.\nThe current store catalog is determined by the default root category, visible to the user in the top navigation (main menu) of the store. (The term \"root category\"  may be confusing, because the \"root category\" isn't really a category at all, but a container for the menu, which consists of categories and sub-categories.)</p>\n<p>You can create as many root categories as you want, but only one (the default) can be used at a time.</p>","id":"9b104f5b-7666-56e5-8c09-9ba317993188"}},{"node":{"frontmatter":{"title":"catalog rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["cart rule","Catalog"]},"html":"<p>Price rules which are applied to specific product(s), and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"e804c9bf-19ab-54a9-8ed3-4c9b4ccfa6c1"}},{"node":{"frontmatter":{"title":"category","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":null},"html":"<p>A group of products that have something in common. The main menu of the store is organized into categories and subcategories of products.</p>","id":"a9853c46-25b2-5502-99cd-192e33ce7be7"}},{"node":{"frontmatter":{"title":"CMS block","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["block","static block"]},"html":"<p>A special variant of block that can only be created in the Magento Admin and can't be referenced through layout files.</p>","id":"ee9d91b8-0ea0-596d-990d-b73766e7cfbd"}},{"node":{"frontmatter":{"title":"configurable product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A configurable product looks like a single product with drop-down lists of options for each variation. Each option is actually a separate simple product with a unique SKU, which makes it possible to track inventory for each product variation.\nTo achieve a similar effect, a simple product can be used with custom options, but without the ability to track inventory for each variation. Products with multiple options are sometimes referred to as composite product.</p>\n<p>Although a configurable product uses more SKUs, and may initially take a little longer to set up, it can save you time in the long run. If you plan to grow your business, the configurable product type might be a better choice for a product with multiple options.</p>\n<p>Example: T-shirts that can be bought with two colors and three sizes. Six variants need to be created as individual products (each with its own SKU). Then, all variants are added to a configurable product where customers can choose the size and color, and then add it to their cart.</p>","id":"d88ca1ad-033d-5c92-8069-6a2e1a595663"}},{"node":{"frontmatter":{"title":"container","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["layout","block","UI component","HTML","CSS"]},"html":"<p>A type of node in a layout tree (along with blocks and UI components), a container is a defined region on a page that generates HTML (composed as an array of variable items in an ordered list) with CSS attributes. </p>\n<p>The attributes of a container include visibility, horizontal and vertical alignment, autoresizing, edibility, position, and size.</p>","id":"1cf7d8bf-ac3d-5239-a1e0-d1c135fd51cb"}},{"node":{"frontmatter":{"title":"Docker","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>An installation tool that automatically deploys Magento software into a local environment, creating a pre-built environment that can be installed on Mac or Windows. When installation is complete, the “Docker container” will run on Linux, including the Magento 2 source code, an Apache web server, and a MySQL database server. The web server and database server have the Magento 2 Luma demo store pre-loaded.</p>","id":"cfc5e8f1-0879-5b82-adb3-cea0ae967b56"}},{"node":{"frontmatter":{"title":"downloadable product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A digitally downloadable product that consists of one or more files that are downloaded, such as an eBook, music, video, software application, or an update. You can offer an album for sale and sell each song individually. A downloadable product can deliver an electronic version of your product catalog.</p>\n<p>Downloadable files can reside on your server or be provided as URLs to any other server or content delivery network.</p>","id":"57326a12-0855-5dad-bdd3-7ced4205183c"}},{"node":{"frontmatter":{"title":"entity","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute","cart rule","catalog rule"]},"html":"<p>A unique unit or object in programming. Contains attributes or parameters that can be modified. Examples include staging — where an update can change entities such as price rules, products or categories — and database records — where service contracts include data structures that are sent and received.</p>","id":"1710ef5f-3c8a-5f05-9aad-5c7a1fe96025"}},{"node":{"frontmatter":{"title":"extension attribute","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>Extend functionality and often use more complex data types than custom attributes. These attributes do not appear on the GUI.</p>","id":"f72800f1-baca-50a6-9757-233ed32a00b0"}},{"node":{"frontmatter":{"title":"extension","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Magento component","module","package"]},"html":"<p>Code that extends or customizes Magento behavior. You can optionally package and distribute an extension on Magento Marketplace or another extension distribution system. A Magento extension can include modules, themes, and language packs.</p>","id":"b39a89a1-4887-587c-94dd-fb4cca330d68"}},{"node":{"frontmatter":{"title":"gift card","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>A prepaid card or or gift certificate that can be used to make purchases in the store. Each gift card is assigned a unique code which is entered at checkout. The value of the gift card is reflected in the gift card account balance. There are three types of gift cards: </p>\n<p>• \"Physical\" gift cards can be produced from plastic or card stock, shipped to the customer.\n• \"Virtual\" gift cards are sent by email.\n• \"Combined\" gift cards are a combination of the two, shipped to the recipient as a physical card and also delivered by email.\nGift cards are configurable, including options for product eligibility and selection of open or fixed amounts.</p>\n<p>A gift card can also be redeemed by the store administrator on customer request when the order is being created in the backend.</p>\n<p>Gift cards also help promotions, as store administrators can manually create the gift card accounts in the backend and send the gift card codes to the specific customer segment. Gift cards can serve as a loyalty program targeted at the most active customers who make a lot of purchases from the web store or a specific promotional campaign during the holidays.</p>","id":"287f52d3-f7a6-5a9b-83d8-842c93ec5394"}},{"node":{"frontmatter":{"title":"grouped product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["simple product","product types"]},"html":"<p>A product type with several similar, standalone products grouped on a single page.  Can be offered with variations of a single product or by grouping them by season or theme to create a coordinated set. Each product can be purchased separately, or as part of the group.</p>\n<p>For example, for a knife that's available in four sizes, all four knives can be displayed within a grouped product page. Customers can select the sizes they want and add them to the cart from this page.</p>","id":"b5edc52d-6596-58ea-a5d6-f2c6ef171392"}},{"node":{"frontmatter":{"title":"layout update","wordClasses":["noun"],"tags":["design","magento-software"],"synonyms":[],"relatedTerms":["layout update examples"]},"html":"<p>Used for snippets of code that that are added to modify the XML layout or to import the layout instructions from another file.</p>","id":"4da08c0c-4e68-54ee-9b5b-8fdd117629fa"}},{"node":{"frontmatter":{"title":"layout","wordClasses":["noun"],"tags":["design","magento-software"],"synonyms":[],"relatedTerms":["layout instructions","block"]},"html":"<p>In the construction of a Magento page, a layout is a series of blocks assembled in a hierarchy, representing the structure of the page. </p>\n<p>Page layout files focus on the highest level of page structure (header, footer, main content area, left sidebar, etc.). Layout files then assemble content (blocks) into these different areas on the page.</p>","id":"d9d05a5a-ee6f-56d9-849b-9626a8ca3110"}},{"node":{"frontmatter":{"title":"library","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["third-party library"]},"html":"<p>In the Magento system, a logical grouping of functionality or related code within the framework layer. Magento includes its own framework libraries as well as third-party libraries within the software.</p>","id":"3f3d508a-f17f-5b34-b9c8-981fa62810a4"}},{"node":{"frontmatter":{"title":"Magento Admin","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["Admin","Admin Panel","backend","Administration Interface","Admin UI"],"relatedTerms":["admin"]},"html":"<p>The password-protected back office of your store where orders, catalog, content, and configurations are managed. Users access the Magento Admin to manage the store, including products, orders, shipments, CMS content, design of the storefront, customer information, etc. Magento users have an associated role with permissions that controls access to features, options, and capabilities. </p>","id":"b743286b-f860-58ba-b953-3ffa46947029"}},{"node":{"frontmatter":{"title":"Magento compiler","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["compiler"],"relatedTerms":null},"html":"<p>Used to generate all auto-generated Magento code in advance. Improves performance of Magento by precompiling information used during runtime.</p>","id":"b5e5d51a-efe5-525d-941d-ff41757ed7e9"}},{"node":{"frontmatter":{"title":"Magento component","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["component"],"relatedTerms":["UI component"]},"html":"<p>Used to refer to a module, theme, or language package in Magento.</p>","id":"9b0422a4-2b08-554b-9731-f7188f8fc022"}},{"node":{"frontmatter":{"title":"Magento file system owner","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Overview of Ownerships and Permissions"]},"html":"<p>The user who owns files in the Magento file system. It’s very important to set up this user properly. Different hosting setups have different requirements.</p>","id":"fd8f4987-e413-50e0-a251-582d6235b519"}},{"node":{"frontmatter":{"title":"Magento","wordClasses":["adjective"],"tags":["business","magento-software"],"synonyms":[],"relatedTerms":["Magento Trademark Requirements"]},"html":"<p>The company — its full name is \"Magento Commerce\" and legally is called \"Magento, Inc.\" — includes several products in the following categories: digital commerce, order management, and other industry solutions. The Magento term is a registered trademark and a company name.</p>","id":"656301d6-5e41-59f1-bdc8-d773086a6ec9"}},{"node":{"frontmatter":{"title":"module (training)","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>The smaller sections within an on-demand course.</p>","id":"8b68aee8-8ac8-58a8-94da-660e7e6ec840"}},{"node":{"frontmatter":{"title":"module","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["Module Reference","Magento Module","PHP","XML","block"]},"html":"<p>Code that changes or extends features provided by the Magento application. A module is contained in a directory structure that contains PHP and XML files (configuration, blocks, controllers, helpers, models, and so on) related to a specific functionality to deliver a distinct collection of product features.\nThe purpose of each module is to provide specific product features by implementing new functionality or extending the functionality of other modules. Each module is designed to function independently, so the inclusion or exclusion of a particular module does not impact the functionality of other modules.</p>\n<p>A module can also implement widgets, which are page elements that can be customized by business users in the Admin .</p>\n<p>Modules can be disabled or removed without breaking the consistency of the Magento application. One exception: When the module depends on other modules, which requires disabling or removing the dependant modules.</p>","id":"686fca93-e27b-56ed-aa37-792d305b4e10"}},{"node":{"frontmatter":{"title":"Page Builder","wordClasses":["noun"],"tags":["magento-software"],"synonyms":["Admin","Admin Panel","backend","Administration Interface","Admin UI"],"relatedTerms":["admin"]},"html":"<p>Page Builder is a Magento extension for creating content-rich pages by dragging-and-dropping pre-built controls to define custom layouts.  We call these controls “content types.” Merchants can design layouts and pages without coding experience. Extension support is provided for developers to extend and programmatically work with Page Builder.</p>","id":"0c0b016f-8a29-58d8-a578-8381d0f5f556"}},{"node":{"frontmatter":{"title":"product types","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":null},"html":"<p>Magento classifies products as one of several predefined product types including simple product, virtual product, downloadable product, grouped product, configurable product, bundle product, and gift card.</p>","id":"32165c39-163a-5d8e-87f7-b06a06dcceae"}},{"node":{"frontmatter":{"title":"related product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":null},"html":"<p>A selection of products that is presented as an incentive to purchase additional items. For example, if the customer is viewing the product page for a camera, the related products might include other comparable cameras, a camera case, and tripod.</p>","id":"49edd11b-1ee0-5265-9c9e-eff8db120c35"}},{"node":{"frontmatter":{"title":"relative link","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>A hyperlink that includes only the address of the linked page that is relative to the linking page, rather than the full URL. </p>\n<p>A relative link needs the full URL of the current page to be resolved. Web browsers resolve relative links into full links before sending to a web server. Relative links frequently are used to reference web assets located in the same directory as the current asset. (Example: \"style.css\" is a relative link.)</p>","id":"b4f82948-3e7b-5e1a-92ba-f79bf3d626ed"}},{"node":{"frontmatter":{"title":"release candidate","wordClasses":["noun"],"tags":["magento-software","programming"],"synonyms":["beta version","RC"],"relatedTerms":null},"html":"<p>A type of beta version that is almost ready to become finalized, unless significant bugs emerge. The Magento community is encouraged to provide feedback and Pull Requests (PR) in GitHub to fix errors in code, design, and documentation.</p>","id":"694a4621-eb8a-5dd8-8a5c-c9f7ed3f4d17"}},{"node":{"frontmatter":{"title":"sales rules","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["cart rule","catalog rule"]},"html":"<p>Includes cart and catalog rules, which used to price a product for promotions.</p>","id":"68298196-37bb-5b92-bcfa-04a1177056d7"}},{"node":{"frontmatter":{"title":"scope","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>In Magento, scope describes the extent of your store hierarchy that a setting can affect. Scope can apply to the following:\n• Global — all websites, stores, and store views\n• Website — the selected website and all stores and store views under it\n• Store — the selected store and all store views under it\n• Store View — the selected store view.\nWithin the hierarchy, settings applied at a lower level can override some higher-level settings.</p>","id":"983944dc-ec2f-523b-af42-cac898195d2a"}},{"node":{"frontmatter":{"title":"Shared Catalog","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["Catalog"]},"html":"<p>A feature that allows merchants to create a catalog that can serve as their entire catalog or a subset of it, and then assign custom prices for one or more products. Merchants can then assign this catalog to one or more companies.</p>\n<p>For example, a B2B merchant has three customers who’ve negotiated specific rates for his electronics distribution site. Using the shared catalog feature, the merchant has:\n• a main catalog\n• a customer 1 catalog (perhaps it’s just three SKUs with heavy discounts on them from the main catalog)\n• customer 2 catalog (could be the entire catalog with 10% off)\n• customer 3 catalog (a few dozen products with discounts off the main catalog ranging from 5% - 60%).</p>","id":"9a3e90a7-999e-5563-882d-d4401eba7c39"}},{"node":{"frontmatter":{"title":"simple product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>This is the most basic product type, a physical item with a single SKU. Simple products have a variety of pricing and of input controls which makes it possible to sell variations of the product. Simple products can be used in association with grouped, bundle, and configurable products. A simple product with custom options is sometimes referred to as a composite product.</p>","id":"438b3196-ff9b-5941-9ce3-8923e959f9de"}},{"node":{"frontmatter":{"title":"static block","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["CMS block","block"]},"html":"<p>A modular unit of content that can be placed by a user in the CMS on a page to display text and images, or execute snippets of code. Static blocks contain editable content and can act as landing pages for product categories. Widgets can be added to static blocks to provide additional functionality.</p>","id":"8b6882fa-da92-580f-a0c6-08df5f3f62ff"}},{"node":{"frontmatter":{"title":"static files","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["CSS","JavaScript"]},"html":"<p>The collection of assets, such as CSS, fonts, images, and JavaScript that is used by a theme.</p>","id":"cb2a33d4-35ad-5172-b743-68158ccb3f09"}},{"node":{"frontmatter":{"title":"static page","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["dynamic content"]},"html":"<p>A page with the main content area that is manually populated with content and is easier to cache. Does not use dynamic content.</p>","id":"d092f018-2ab4-5a7b-9756-5b672c3a9a64"}},{"node":{"frontmatter":{"title":"store view","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["store","website"]},"html":"<p>The Magento scope level of \"store view\" refers to third level in the hierarchy of website(s), store(s) and store view(s).  Store views  typically present the storefront in a different locale and language. Use the store chooser in the header to change store views.</p>","id":"56738bc8-3b5c-5e98-9162-0209d62dad65"}},{"node":{"frontmatter":{"title":"store","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["store view","website"]},"html":"<p>The Magento scope level of \"store\" is the second level of your website's hierarchy, which goes as follows: websites(s) > store(s) > store view(s). Stores can be organized into one or many. Each store, potentially, has its own root category, and all share the same catalog and customer data. </p>\n<p>Each store can have multiple store views, which are typically used to present the storefront in a different locale and language.</p>","id":"8b4043c7-d00b-5f84-8b9e-798efc25248c"}},{"node":{"frontmatter":{"title":"storefront","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":null},"html":"<p>The online store that customers experience when they visit your Magento site.</p>","id":"34a50554-d867-5a12-a8cf-9807d840cf13"}},{"node":{"frontmatter":{"title":"template","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":["block"]},"html":"<p>Short for HTML template or PHTML template. A PHTML file contains a mixture of HTML markup and PHP code to inject dynamic content into the HTML. Most blocks have at least one PHTML (template) file that contains the static HTML generated by the block.\nIn the Admin, email and newsletter templates combine text, images, and variables with HTML markup to produce personalized content that is sent by the system.</p>","id":"b213bdb4-5c56-55b9-a9f9-882c551aeb0d"}},{"node":{"frontmatter":{"title":"theme","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>Contains graphics and appearance information. Customizes the look and feel of the store.\nMagento can ship themes in (Composer) packages. But themes can be placed under app / design, which are not shipped in a package. Packages are the unit of download for Composer, and — via Magento Marketplace — Magento users can download CE or EE as a series of packages, where packages contain modules, themes, or language packs.</p>","id":"8a605efe-cd6a-5052-9db4-05ad481cbec1"}},{"node":{"frontmatter":{"title":"unit","wordClasses":["noun"],"tags":["magento-software"],"synonyms":[],"relatedTerms":null},"html":"<p>Each standalone on-demand part of a larger course is called a unit.</p>","id":"994a39a4-6d59-5941-bf10-52679ed8db39"}},{"node":{"frontmatter":{"title":"virtual product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product types"]},"html":"<p>Represents a non-physical product that can be sold, such as a membership, service, warranty, or subscription. Virtual products can be sold individually, or included as part of the following product types: grouped product and bundle product. Does not require shipping or inventory. </p>\n<p>The process of creating a virtual product and a simple product is nearly the same. However, because a virtual product is not shipped, there is no Weight field or option to include a gift card.</p>","id":"f3bec5dd-468a-5141-bbe8-e8b32a999f04"}},{"node":{"frontmatter":{"title":"website","wordClasses":["noun"],"tags":["magento-software","design","product"],"synonyms":[],"relatedTerms":["store","store view"]},"html":"<p>In Magento software, the highest level of a website hierarchy, above store and store view. You can have multiple websites, and each website can have a different domain name. Websites can be set up to share customer data, or to not share data.</p>","id":"3e4f94af-2a74-53aa-93a3-57cf03726140"}},{"node":{"frontmatter":{"title":"widget","wordClasses":["noun"],"tags":["business","magento-software"],"synonyms":[],"relatedTerms":["block"]},"html":"<p>A widget is a prepared snippet of code that can be used to place blocks, links, and dynamic content at specific locations on store pages.</p>","id":"0e9bb9f2-56ed-5418-880a-2324154ae97d"}}]},"tagListJson":{"slug":"magento-software"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"magento-software"}}