{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"cart rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["catalog rule","shopping cart"]},"html":"<p>Price rules which are applied to the shopping cart, and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"26f4863e-6cb4-5f52-8f0b-607f4b2c1f4e"}},{"node":{"frontmatter":{"title":"Catalog","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["Shared Catalog","catalog rule"]},"html":"<p>For merchants, the catalog represents their product inventory. Within Magento’s architecture, the catalog consists of categories, products, and product attributes.</p>\n<p>Each Magento store has only one product catalog, which is shared by all store views. In a multi-store installation, each store can have a separate catalog, or share the same catalog.\nThe current store catalog is determined by the default root category, visible to the user in the top navigation (main menu) of the store. (The term \"root category\"  may be confusing, because the \"root category\" isn't really a category at all, but a container for the menu, which consists of categories and sub-categories.)</p>\n<p>You can create as many root categories as you want, but only one (the default) can be used at a time.</p>","id":"9b104f5b-7666-56e5-8c09-9ba317993188"}},{"node":{"frontmatter":{"title":"catalog rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["cart rule","Catalog"]},"html":"<p>Price rules which are applied to specific product(s), and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"e804c9bf-19ab-54a9-8ed3-4c9b4ccfa6c1"}},{"node":{"frontmatter":{"title":"average inventory cost","wordClasses":["noun"],"tags":["product","pricing","inventory"],"synonyms":[],"relatedTerms":null},"html":"<p>Product price, less coupons or discounts, plus freight and applicable taxes. The average is determined by adding the beginning cost of inventory each month, plus the ending cost of inventory for the last month of the period.</p>","id":"575b0da3-d8a9-5aad-aa4d-ade804ca0b62"}},{"node":{"frontmatter":{"title":"base currency","wordClasses":["noun"],"tags":["pricing"],"synonyms":[],"relatedTerms":null},"html":"<p>The primary currency that is used per store view for all online payments. Stores can accept currencies from more than two hundred countries around the world. The store front provides a currency selector for multiple accepted currencies for a specific country or locale. Currency symbols appear in product prices and sales documents such as orders and invoices. You can customize the currency symbols as needed, and also set the display of the price separately for each store or view.</p>","id":"9f644dc0-6ba4-596d-b534-fa61fcb6b88d"}},{"node":{"frontmatter":{"title":"freight on board","wordClasses":["noun"],"tags":["business","order","pricing"],"synonyms":["fob"],"relatedTerms":[]},"html":"<p>In international shipping, this term means that the receiving party is responsible for the shipping charges. FOB can be based on the place of origin or destination, and be designated as either freight collect or freight prepaid.</p>","id":"88c9fb3d-9ace-58bc-aac6-378506b8188e"}},{"node":{"frontmatter":{"title":"SKU","wordClasses":["noun"],"tags":["business","pricing","product","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Abbreviation for Stock Keeping Unit. A number or code assigned to a product to identify the product, options, price, and manufacturer.</p>","id":"fe12a10c-518a-5419-912c-9e71d0aa830b"}}]},"tagListJson":{"slug":"pricing"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"pricing"}}