{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"attribute","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":["product attribute","custom attribute"],"relatedTerms":["extension-attribute"]},"html":"<p>A characteristic or property of a product that describes some aspect of the product. Magento users can create custom attributes to add to the default attribute set or a custom attribute set. Create these attributes through the Magento Admin or programmatically. Examples: color, size, weight, price, age, gender, etc.</p>\n<p>Custom attributes are a type of Entity-Attribute-Value (EAV) attribute.</p>\n<p>For integrations like Google Shopping ads Channel and Amazon Sales Channel, you map Magento attributes to attributes in the third-party to properly display and sell products, display ads, etc.</p>\n<p>Learn more: <a href=\"https://devdocs.magento.com/guides/v2.3/extension-dev-guide/attributes.html\">EAV and extension extension_attributes</a></p>","id":"389b1dd1-9ddd-5d12-ab83-2b41e9a021b8"}},{"node":{"frontmatter":{"title":"attribute set","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["attribute"]},"html":"<p>A collection of attribute groups, customized for a specific product. Example: A T-shirt attribute set might include color, size, gender, and brand.</p>","id":"06b8715a-a5fe-5f89-9111-59fadafab9f3"}},{"node":{"frontmatter":{"title":"average inventory cost","wordClasses":["noun"],"tags":["product","pricing","inventory"],"synonyms":[],"relatedTerms":[]},"html":"<p>Product price, less coupons or discounts, plus freight and applicable taxes. The average is determined by adding the beginning cost of inventory each month, plus the ending cost of inventory for the last month of the period.</p>","id":"dba62d1b-c4cc-55e0-a581-acb6e26f16bd"}},{"node":{"frontmatter":{"title":"bundle product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["simple-product","virtual-product","product-types"]},"html":"<p>Lets customers assemble a \"build your own\" customizable product from a variety of options and configurations. Each item in the bundle is either a separate simple or virtual product.</p>\n<p>Learn more: <a href=\"https://docs.magento.com/m2/ee/user_guide/catalog/product-create-configurable.html\">Configurable Products</a></p>","id":"ccf3328d-ab00-527b-99ce-50a50c992b49"}},{"node":{"frontmatter":{"title":"cart rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["catalog rule","shopping cart"]},"html":"<p>Price rules which are applied to the shopping cart, and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"652c1473-0089-5f9a-a4aa-0dd11c287bfb"}},{"node":{"frontmatter":{"title":"catalog rules","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["cart-rule","catalog"]},"html":"<p>Price rules which are applied to specific product(s), and trigger an action in response to a set of conditions. Used to create promotions.</p>","id":"c6d9c4b8-040d-5654-9503-53325c830974"}},{"node":{"frontmatter":{"title":"category","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":[]},"html":"<p>A group of products that have something in common. The main menu of the store is organized into categories and subcategories of products.</p>","id":"fa32994d-d585-540d-99bc-30c2894b4799"}},{"node":{"frontmatter":{"title":"checkout","wordClasses":["noun"],"tags":["business","design","order","product","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>The process of gathering the payment and shipping information that is necessary to complete the purchase of items in the shopping cart. After the customer reviews the information and submits the order, an email confirmation is sent to the customer.</p>\n<p>Checkout has many options and configuration out-of-the-box and through extension.</p>\n<p>Learn more: <a href=\"https://devdocs.magento.com/guides/v2.3/howdoi/checkout/checkout_overview.html\">Checkout Tutorial</a>, <a href=\"https://docs.magento.com/m2/ce/user_guide/sales/checkout-configuration.html\">Checkout configuration</a></p>","id":"89910035-48bb-5645-8b8d-16fac4f82b23"}},{"node":{"frontmatter":{"title":"Catalog","wordClasses":["noun"],"tags":["magento-software","pricing","product"],"synonyms":[],"relatedTerms":["shared-catalog","catalog-rule"]},"html":"<p>For merchants, the catalog represents their product inventory. Within Magento’s architecture, the catalog consists of categories, products, and product attributes.</p>\n<p>Each Magento store has only one product catalog, which is shared by all store views. In a multi-store installation, each store can have a separate catalog, or share the same catalog.\nThe current store catalog is determined by the default root category, visible to the user in the top navigation (main menu) of the store. (The term \"root category\"  may be confusing, because the \"root category\" isn't really a category at all, but a container for the menu, which consists of categories and sub-categories.)</p>\n<p>You can create as many root categories as you want, but only one (the default) can be used at a time.</p>","id":"afae22cd-0ff8-5a8f-95b6-b95eb5781503"}},{"node":{"frontmatter":{"title":"configurable product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product-types"]},"html":"<p>A configurable product looks like a single product with drop-down lists of options for each variation. Each option is actually a separate simple product with a unique SKU, which makes it possible to track inventory for each product variation.\nTo achieve a similar effect, a simple product can be used with custom options, but without the ability to track inventory for each variation. Products with multiple options are sometimes referred to as composite product.</p>\n<p>Although a configurable product uses more SKUs, and may initially take a little longer to set up, it can save you time in the long run. If you plan to grow your business, the configurable product type might be a better choice for a product with multiple options.</p>\n<p>Example: T-shirts that can be bought with two colors and three sizes. Six variants need to be created as individual products (each with its own SKU). Then, all variants are added to a configurable product where customers can choose the size and color, and then add it to their cart.</p>","id":"1a5e8b96-1e62-5211-9331-564082b2ade7"}},{"node":{"frontmatter":{"title":"cross-sell","wordClasses":["noun","adjective","verb"],"tags":["business","product"],"synonyms":[],"relatedTerms":["upsell"]},"html":"<p>A product that appears next to the shopping cart. When a customer navigates to the shopping cart page, these products are displayed as cross-sells to the items already in the shopping cart. They are similar to impulse buys, like magazines and candy at the cash registers in grocery stores.</p>","id":"88bb2eb3-a13a-5af4-a17d-4725f0fcbb09"}},{"node":{"frontmatter":{"title":"downloadable product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product-types"]},"html":"<p>A digitally downloadable product that consists of one or more files that are downloaded, such as an eBook, music, video, software application, or an update. You can offer an album for sale and sell each song individually. A downloadable product can deliver an electronic version of your product catalog.</p>\n<p>Downloadable files can reside on your server or be provided as URLs to any other server or content delivery network.</p>","id":"37eaff33-826f-5253-ae4c-e34a7a7208e7"}},{"node":{"frontmatter":{"title":"grouped product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["simple-product","product-types"]},"html":"<p>A product type with several similar, standalone products grouped on a single page.  Can be offered with variations of a single product or by grouping them by season or theme to create a coordinated set. Each product can be purchased separately, or as part of the group.</p>\n<p>For example, for a knife that's available in four sizes, all four knives can be displayed within a grouped product page. Customers can select the sizes they want and add them to the cart from this page.</p>","id":"6e45c848-cc4a-526e-91fb-c78b524d7a4c"}},{"node":{"frontmatter":{"title":"product types","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":[]},"html":"<p>Magento classifies products as one of several predefined product types including simple product, virtual product, downloadable product, grouped product, configurable product, bundle product, and gift card.</p>","id":"3a24bb62-ad90-54db-afa8-2f86082054c9"}},{"node":{"frontmatter":{"title":"related product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":[]},"html":"<p>A selection of products that is presented as an incentive to purchase additional items. For example, if the customer is viewing the product page for a camera, the related products might include other comparable cameras, a camera case, and tripod.</p>","id":"1615c5b5-148b-5bd6-a3eb-ea63421a7199"}},{"node":{"frontmatter":{"title":"sales rules","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["cart-rule","catalog-rule"]},"html":"<p>Includes cart and catalog rules, which used to price a product for promotions.</p>","id":"9c36c66e-f978-50e1-8360-6bb85d016872"}},{"node":{"frontmatter":{"title":"Shared Catalog","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["catalog","b2b"]},"html":"<p>A feature that allows merchants to create a catalog that can serve as their entire catalog or a subset of it, and then assign custom prices for one or more products. Merchants can then assign this catalog to one or more companies.</p>\n<p>For example, a B2B merchant has three customers who’ve negotiated specific rates for his electronics distribution site. Using the shared catalog feature, the merchant has:</p>\n<ul>\n<li>A main catalog</li>\n<li>A customer 1 catalog (perhaps it’s just three SKUs with heavy discounts on them from the main catalog)</li>\n<li>Customer 2 catalog (could be the entire catalog with 10% off)</li>\n<li>Customer 3 catalog (a few dozen products with discounts off the main catalog ranging from 5% - 60%).</li>\n</ul>","id":"9c0c8dea-26ac-5cff-b587-90b4353e1c6f"}},{"node":{"frontmatter":{"title":"shopping cart","wordClasses":["noun"],"tags":["business","design","product","programming"],"synonyms":["cart","basket"],"relatedTerms":["cart-rule"]},"html":"<p>The set of products that a customer has selected to purchase, but has not yet purchased. Also refers to an area of an ecommerce site where these products can be found in order to review and checkout.</p>","id":"5e27dd1f-84a3-5553-bbb6-0fd0d9d29380"}},{"node":{"frontmatter":{"title":"simple product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product-types"]},"html":"<p>This is the most basic product type, a physical item with a single SKU. Simple products have a variety of pricing and of input controls which makes it possible to sell variations of the product. Simple products can be used in association with grouped, bundle, and configurable products. A simple product with custom options is sometimes referred to as a composite product.</p>","id":"2405aecf-1f31-5d1e-90aa-e24733b245e4"}},{"node":{"frontmatter":{"title":"SKU","wordClasses":["noun"],"tags":["business","pricing","product","programming"],"synonyms":[],"relatedTerms":["shared-catalog"]},"html":"<p>Abbreviation for Stock Keeping Unit. A number or code assigned to a product to identify the product, options, price, and manufacturer.</p>","id":"188a131b-cc30-54b1-9211-da5a112de078"}},{"node":{"frontmatter":{"title":"store view","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["store","website"]},"html":"<p>The Magento scope level of \"store view\" refers to third level in the hierarchy of website(s), store(s) and store view(s).  Store views  typically present the storefront in a different locale and language. Use the store chooser in the header to change store views.</p>","id":"e7437416-7504-51f8-8b68-8552016cebb2"}},{"node":{"frontmatter":{"title":"store","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["store-view","website"]},"html":"<p>The Magento scope level of \"store\" is the second level of your website's hierarchy, which goes as follows: websites(s) > store(s) > store view(s). Stores can be organized into one or many. Each store, potentially, has its own root category, and all share the same catalog and customer data.</p>\n<p>Each store can have multiple store views, which are typically used to present the storefront in a different locale and language.</p>","id":"04784c64-788d-520a-aded-4c1191445ba1"}},{"node":{"frontmatter":{"title":"storefront","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":[]},"html":"<p>The online store that customers experience when they visit your Magento site.</p>","id":"cb8d3244-5c16-59f0-82e8-894e613492a7"}},{"node":{"frontmatter":{"title":"virtual product","wordClasses":["noun"],"tags":["magento-software","product"],"synonyms":[],"relatedTerms":["product-types"]},"html":"<p>Represents a non-physical product that can be sold, such as a membership, service, warranty, or subscription. Virtual products can be sold individually, or included as part of the following product types: grouped product and bundle product. Does not require shipping or inventory.</p>\n<p>The process of creating a virtual product and a simple product is nearly the same. However, because a virtual product is not shipped, there is no Weight field or option to include a gift card.</p>","id":"eb7e04d1-d7a9-5cee-b301-4101c2f93ec0"}},{"node":{"frontmatter":{"title":"website","wordClasses":["noun"],"tags":["magento-software","design","product"],"synonyms":[],"relatedTerms":["store","store-view"]},"html":"<p>In Magento software, the highest level of a website hierarchy, above store and store view. You can have multiple websites, and each website can have a different domain name. Websites can be set up to share customer data, or to not share data.</p>","id":"29532322-ccec-536e-99ab-212040f25f6f"}}]},"tagListJson":{"slug":"product"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"product"}}