{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"API","wordClasses":["noun"],"tags":["programming"],"synonyms":["application programming","interface","integration API","web API"],"relatedTerms":["web API","integration API","service contract"]},"html":"<p>Abbreviation for application program interface. A software interface that lets third-party applications read and write to a system using programming language constructs or statements. Magento supports and provides <a href=\"https://devdocs.magento.com/guides/v2.3/get-started/rest_front.html\">REST</a> and <a href=\"https://devdocs.magento.com/guides/v2.3/get-started/soap/soap-web-api-calls.html\">SOAP</a>.</p>","id":"0d6ed593-ec30-550a-bbb7-ab61fca1b115"}},{"node":{"frontmatter":{"title":"anchor text","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["search engine optimization"]},"html":"<p>The text, or label, in a hyperlink that is visible and clickable. Anchor text is important in search engine optimization.</p>","id":"87b3e21c-ea23-503b-ac66-669878357681"}},{"node":{"frontmatter":{"title":"cache backend","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["backend"]},"html":"<p>Stores cache records into a two-level backend system within Zend’s default framework. A first-level cache is fast — for example, an APC or Memcached backend — but it’s limited and doesn’t support tagging and grouping of cache entries. A second-level cache — for example, a file system or a Redis backend — is slower but supports tagging and grouping.</p>","id":"1cef67fb-03f5-5787-84fe-04060e6e2196"}},{"node":{"frontmatter":{"title":"cache frontend","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["frontend"]},"html":"<p>Specifies what kind of data is stored in the cache backend.</p>","id":"d979b8f4-51bd-5ee4-86da-45aace5cbcb3"}},{"node":{"frontmatter":{"title":"cache","wordClasses":["noun","verb"],"tags":["programming"],"synonyms":[],"relatedTerms":null},"html":"<p>Pages (or parts of pages) that are stored to improve the page load time of subsequent requests.</p>","id":"68071a86-3668-5eac-bce8-95af10dd9dcb"}},{"node":{"frontmatter":{"title":"cache type","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["Overview of Cache Types","Manage the Cache"]},"html":"<p>A cache stores data so that future calls for that data can be loaded quicker, and Magento includes these types: configuration, layout, block HTML layout, full page (the most well-known), collections, DDL, EAV, reflection, translation, integration configuration, integration API configuration, web services configuration. Other types can be created and defined.</p>","id":"fc02073c-3c0c-543b-a942-7342dffdb656"}},{"node":{"frontmatter":{"title":"canonical URL","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["search engine optimization","URL"]},"html":"<p>A page's single preferred URL, which can be referenced from multiple URLs. Aids in search engine optimization.</p>","id":"03b97146-775e-5b62-a0e1-60f38d7c00f6"}},{"node":{"frontmatter":{"title":"interception","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["plug-in"]},"html":"<p>The process of injecting new code before, after, or around an existing public function of a PHP class. </p>\n<p>To intercept a function, a plug-in implements the additional code to be invoked. Plug-ins are associated with interception points by the dependency injection configuration file (di.xml). If multiple plug-ins are defined on the same function, the dependency injection configuration defines the order in which the plug-ins are invoked, allowing multiple plug-ins to be used without conflict.</p>","id":"48199b41-b785-52d5-bd14-4ba7aa204bb0"}},{"node":{"frontmatter":{"title":"load sequence","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["module"]},"html":"<p>The order in which scripts are loaded into memory. Used for modules. To work correctly, some scripts must be loaded before others.</p>","id":"c77033ab-994c-5c45-9f18-ae7968b1dafc"}},{"node":{"frontmatter":{"title":"third-party library","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["library"]},"html":"<p>An external set of code developed by a third-party developer or partner.</p>","id":"cf0297d2-e8ed-5e09-8082-45b679df5586"}},{"node":{"frontmatter":{"title":"adapter","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":null},"html":"<p>A class that enables two otherwise incompatible systems to work together without modifying the systems' source code. Examples include database adapters, cache adapters, filesystem adapters, post-processor libraries adapters and other types of computing adapters.</p>","id":"c36f1853-e9b6-54ba-b888-abcc5ce24549"}},{"node":{"frontmatter":{"title":"alt text","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":null},"html":"<p>In a web browser when a user is unable to view an image, alt text (embedded in the HTML code) appears in place of the image. Also, blind or visually impaired users are able to interpret web mages through alt text as they navigate with a screen reader.</p>","id":"e316beec-2a72-5032-bfdf-6066638fef6a"}},{"node":{"frontmatter":{"title":"backend","wordClasses":["noun","adjective"],"tags":["programming"],"synonyms":["server side"],"relatedTerms":["server-side","frontend","cache-backend"]},"html":"<p>Generally used in the same way as \"server side\".</p>\n<p>The Magento Admin and all features for configuring and managing your storefront, products, orders, shipments, etc is considered a backend system.</p>","id":"f4bdfff5-dc8a-5c00-8e71-dc6f4327f874"}},{"node":{"frontmatter":{"title":"batch processing","wordClasses":["noun"],"tags":["programming"],"synonyms":["bulk-operations"],"relatedTerms":[]},"html":"<p>To perform a task or make a change to multiple items all at once, without manual repetition.</p>","id":"6ac4d8ab-2283-5858-aae1-362265a76191"}},{"node":{"frontmatter":{"title":"batch processing","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Bulk operations are actions that are performed on a large scale. Example bulk operations tasks include importing or exporting items, changing prices on a mass scale, and assigning products to a warehouse.</p>","id":"b723f37d-bb7d-5a8e-9ecd-3d192769dec2"}},{"node":{"frontmatter":{"title":"checkout","wordClasses":["noun"],"tags":["business","design","order","product","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>The process of gathering the payment and shipping information that is necessary to complete the purchase of items in the shopping cart. After the customer reviews the information and submits the order, an email confirmation is sent to the customer.</p>\n<p>Checkout has many options and configuration out-of-the-box and through extension.</p>","id":"a7f7ba14-2173-5608-99c4-548f74534c7e"}},{"node":{"frontmatter":{"title":"cloud services","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["software-as-a-service","platform-as-a-service","payments-as-a-service"]},"html":"<p>A resource provided over the internet that hosts or shares computer processing capability and data to computers and other devices on demand. Cloud services include software as a service (SaaS), platform as a service (PaaS) and infrastructure as a service (IaaS).\nBenefits include:\n• Infrastructure costs avoided\n• Savings in infrastructure passed on to core business\n• Applications can be implemented quicker\n• More uptime, when the system is working an available, due to redundancy\n• Less maintenance</p>","id":"ea14bb9e-a6e6-567e-af51-de0e3f60877f"}},{"node":{"frontmatter":{"title":"CMS","wordClasses":["noun"],"tags":["programming"],"synonyms":["content management system"],"relatedTerms":[]},"html":"<p>Abbreviation for \"content management system.\" A software system that is used to create, edit, and maintain content on a website.</p>","id":"5965b028-4e43-5e0c-b736-e441e1eceb75"}},{"node":{"frontmatter":{"title":"code migration","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>In general, processes related to translating code from one application to another. The Magento code migration tool assists you with porting Magento 1 customizations to Magento 2.</p>","id":"0aad3900-3185-5554-9a41-5cc51610d090"}},{"node":{"frontmatter":{"title":"Compass","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["css","sass"]},"html":"<p>An open-source CSS authoring framework that is an extension of the Sass stylesheet language. Compass includes a compiler and a large collection of mixins and functions. Can be bundled into a library and used in multiple projects without requiring using multiple sources for each project.</p>","id":"f114dbe6-2378-5848-a7b7-f0d1e9418edf"}},{"node":{"frontmatter":{"title":"Composer package","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["composer","composer-website","package"]},"html":"<p>A library, or file bundle, that is obtained using Composer — an external software — and that provides functionality or fulfills a dependency. The content of the package contains PHP code, a name and a version that identify the package, as well as metadata. For installation, the source definition is the information that is most relevant — this describes where to get the package contents and any dependencies.</p>","id":"05190748-6fa7-59fe-9338-dd9e29dfd7b0"}},{"node":{"frontmatter":{"title":"complex data","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Data that is associated with multiple product options.</p>","id":"754b5611-079f-5f73-9bcd-925254d3cc29"}},{"node":{"frontmatter":{"title":"Composer","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>The technology used to download items that works manages dependencies in PHP. This tool allows users to specify libraries to be used and it manages the installation and updates for the libraries.</p>\n<p>A “package” is the composer’s smallest unit of delivery. Example: A .zip file containing a directory tree of files. Composer places each Magento component — module, theme or language pack — to be downloaded into a separate package, creating a 1:1 relationship between components and packages.</p>\n<p>In Magento, we use Composer to package components and manage installations of Magento core, modules, extensions, etc. We recommend developers and merchants include composer.json in the component’s root directory even if they do not intend to distribute it to other merchants using Magento</p>","id":"680d5f57-c307-5183-b860-1312451f47f5"}},{"node":{"frontmatter":{"title":"composite pattern","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>The composite pattern is a programming design pattern that describes the uniform treatment of single objects or a composition of objects.</p>","id":"5d170ab5-6bc0-525b-b3d6-c669143aa96a"}},{"node":{"frontmatter":{"title":"content delivery network","wordClasses":["noun"],"tags":["programming"],"synonyms":["CDN"],"relatedTerms":[]},"html":"<p>A large distributed network of servers that specializes in the high performance delivery of multimedia content.</p>","id":"abcd05fd-7a34-538d-9560-834c66dd21fb"}},{"node":{"frontmatter":{"title":"database schema","wordClasses":["noun"],"tags":["programming"],"synonyms":["schema"],"relatedTerms":[]},"html":"<p>The structure of data in a database. Defines how data is organized and how data relationships are governed, including all constraints applied to the data. A module can contain fragments of the database schema if that module has data that needs to be stored in the database.</p>","id":"a0b26ef3-f1cb-5451-9c8f-72677c34df01"}},{"node":{"frontmatter":{"title":"dependency injection","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A software design pattern that allows a class to specify its dependencies without having to construct them. This class delegates the responsibility of injecting the dependency to the calling class. Used to make testing easier. To define dependencies for classes, edit the di.xml configuration file.</p>","id":"b37e6c06-77b6-5249-a9c2-ed300273977c"}},{"node":{"frontmatter":{"title":"dynamic media URL","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["content-delivery-network","url"]},"html":"<p>A URL address that is generated dynamically by the system to reference an image or other media. The address links directly to assets stored on a server or a content delivery network.\nTo use a static URL, change the configuration setting. However, if dynamic media URLs are included in your catalog when you disable the setting, each reference in your catalog will become a broken link. Links can be restored by again enabling dynamic media URLs. Using dynamic media URLs can affect catalog search's performance.</p>\n<p>Code format: media url=\"path/to/image.jpg\"</p>","id":"61006fbb-08bd-5c7c-bd04-428a384b3d31"}},{"node":{"frontmatter":{"title":"entity attribute value","wordClasses":["noun"],"tags":["programming"],"synonyms":["eav"],"relatedTerms":null},"html":"<p>For database entities, a data model that efficiently encodes entities. Stores the entity id, attribute name, and value as a triple, which allows new entity attribute names to be created at any time. In encoding, the number of attributes that can be used to describe entities can scale extensively, but the number that applies to a given entity is minimized. This data model is very flexible, but can be slow.</p>","id":"69b91183-b2ee-561f-8a0d-540a06fe96ca"}},{"node":{"frontmatter":{"title":"event","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A user action or other occurrence that is detected by the system and triggers a response. Interactive experiences are made possible by events that change the program flow. Software typically incorporates event loops or other dedicated event handlers to identify and manage events.</p>","id":"a3dcbe17-03b1-5fa8-b22a-2b797938685f"}},{"node":{"frontmatter":{"title":"exception handler","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A software mechanism that manages the response to an exception. The manner in which an exception is handled might change the program flow and require specialized programming.</p>","id":"6044e28c-ecfe-57c3-a076-cf1155456ee9"}},{"node":{"frontmatter":{"title":"exception","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>An abnormal condition that requires special processing.</p>","id":"a8d1ce22-ae26-5132-8ddd-94bf060f470d"}},{"node":{"frontmatter":{"title":"framework","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["module"]},"html":"<p>A software framework is a foundation of defined code in which more code can be added to fully customize or build out the software.</p>\n<p>In the Magento framework, parts of the software leverage Zend, an open-source, object-oriented PHP framework. Modules are built using the Magento framework.\nFrameworks can be used for developing software applications, products and solutions (combinations of products and services). To integrate different components, development can include integration of APIs, code libraries, compilers, support programs and other toolsets.</p>\n<p>Unlike libraries, frameworks feature the following:</p>\n<ul>\n<li>Flow of control dictated by the framework, not the caller</li>\n<li>A default behavior that is user-centric and logical</li>\n<li>Extensibility, enabling users to more easily build an application</li>\n</ul>","id":"79fdecce-02f2-558b-9a57-31876975a101"}},{"node":{"frontmatter":{"title":"frontend developer","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":["html","css","javascript"]},"html":"<p>A developer who uses technologies such as HTML, CSS, and JavaScript to develop the user interface or presentation layer for an application.</p>","id":"c19c78e1-d6d3-527f-a296-35473ad24fb8"}},{"node":{"frontmatter":{"title":"frontend properties","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Properties that determine the presentation and behavior of an attribute from the standpoint of the customer in your store.</p>","id":"bfc325e2-064a-5c94-8ea1-e6c4af841fbd"}},{"node":{"frontmatter":{"title":"frontend","wordClasses":["adjective"],"tags":["design","programming"],"synonyms":["client side"],"relatedTerms":["backend","storefront","cache-frontend"]},"html":"<p>In a client-server application, there is the backend and frontend. The frontend component, or client, is an interface that enables users to manipulate or interact with the underlying backend code. Backend code runs on a server. A user cannot directly access backend code. A user interacts with the storefront, which in turn uses code running on the Magento server.\nNote: In the past, the Magento storefront has been referred to as the \"frontend\", and the Magento Admin has been referred to as the \"backend\". This usage is no longer supported.</p>","id":"8c3a734a-a928-5fdc-96a6-30fdff5e1afe"}},{"node":{"frontmatter":{"title":"GraphQL","wordClasses":["noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio","Community Engineering"],"relatedTerms":["pwa","react"]},"html":"<p><a href=\"https://graphql.org/\">GraphQL</a> is a data query language developed internally by Facebook in 2012 before being publicly released in 2015. Magento implements GraphQL to provide an alternative to REST and SOAP web APIs for frontend development.</p>\n<p><a href=\"https://magento-research.github.io/pwa-studio/\">PWA Studio</a> uses GraphQL for development. GraphQL is a specification for a data query language on the client side and a service layer on the server side. It is often seen as an alternative to using REST endpoints.</p>\n<p>One of the main advantages GraphQL has over REST is that a single GraphQL endpoint can accommodate requests for any combination of X, Y, and Z pieces of data, whereas REST requires specialized endpoints for different data request combinations. Unlike REST, which can require multiple server requests to aggregate data, a single GraphQL request returns only the data needed and nothing more.</p>\n<p>Performance is an important metric for PWAs. Using GraphQL improves this by reducing the number of server calls and the amount of data returned.</p>\n<p>GraphQL is also a Magento Community Engineering project, open to contributions:</p>\n<ul>\n<li><a href=\"https://github.com/magento/graphql-ce\">GitHub Repository</a></li>\n<li><a href=\"https://app.zenhub.com/workspaces/graphql-ce-5ac50492bdeaaf56b9c80e00/boards?milestones=Release%3A%202.3.1%232019-02-01&#x26;epics:settings=noEpics&#x26;repos=128075669\">ZenHub</a></li>\n<li><a href=\"https://magentocommeng.slack.com/messages/C8076E0KS\">#graphql Slack Channel</a></li>\n</ul>","id":"ecc8b3aa-1abb-5a79-a7eb-7fb76edf1f9c"}},{"node":{"frontmatter":{"title":"handle","wordClasses":["noun"],"tags":["programming"],"synonyms":["page handle"],"relatedTerms":[]},"html":"<p>Generally, a handle is a way to reference an object. In Magento, handles are used in many places, most commonly to identify a page. For page handles, the handle name is derived from the URL, then used to locate and load the layout files for the referenced page.\nFor example, in the Magento Customer module, there is a layout file called “view/frontend/layout/checkout<em>cart</em>index.xml”. Here “frontend” is the area name and “checkout<em>cart</em>index” is the handle name, both of which are derived from the URL.</p>","id":"5ec61e5f-c515-55a3-a867-e75344378161"}},{"node":{"frontmatter":{"title":"HTML","wordClasses":["noun"],"tags":["design","programming"],"synonyms":["HyperText Markup Language"],"relatedTerms":["css"]},"html":"<p>Abbreviation for \"HyperText Markup Language\". A coding language with tags that identify and structure text, images, videos, and other media on a web page.</p>","id":"f1e8ae33-92ac-5301-bb1c-1f3af659755c"}},{"node":{"frontmatter":{"title":"integration API","wordClasses":["noun"],"tags":["programming"],"synonyms":["API","web API"],"relatedTerms":["api"]},"html":"<p>An API endpoint that can be used by third-party applications to access a particular device.</p>","id":"cfe390e4-7897-5638-9008-68bc973e6445"}},{"node":{"frontmatter":{"title":"JavaScript","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":["html","ui-component"]},"html":"<p>A scripting language that can be used with HTML to produce dynamic effects and interactions on web pages.</p>","id":"435141a4-5a16-5f4a-913f-eb40908bb12c"}},{"node":{"frontmatter":{"title":"jQuery","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":["javascript"]},"html":"<p>A popular JavaScript library often used to create dynamic and responsive effects.</p>","id":"8bc3c9ff-cfe5-5b06-aaa0-4f3d5209b3ed"}},{"node":{"frontmatter":{"title":"language package","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["magento-component","package"]},"html":"<p>Provides translation dictionaries used to localize the Magento application. A language package includes one or more translation files. A package is a one of the components in Magento, which also include modules and themes.</p>","id":"0f02f1ef-9621-5ec9-bf13-7e08dbee2af6"}},{"node":{"frontmatter":{"title":"layout instructions","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":["layout","block","containers","ui-components"]},"html":"<p>Markup in a layout file that describes changes to be applied to a structured element tree of blocks, containers, and UI components. A single layout file can contain multiple layout instructions. Layout instructions are encoded in XML in layout files.</p>","id":"2872d1d2-559f-5d1f-baa0-e1c13a981784"}},{"node":{"frontmatter":{"title":"Less","wordClasses":["noun"],"tags":["design","programming"],"synonyms":["LESS"],"relatedTerms":["css","html"]},"html":"<p>Stands for \"Leaner CSS\". Simply put, Less combines CSS language (which applies visual styles to HTML pages) with other items - embedded variables, mixins, functions, and other features.</p>\n<p>This combination enables CSS to be themed and more maintainable and extendable. As a pre-processor, Less processes and exports its code into a standard CSS file that browsers can read and render into web pages.</p>","id":"3d69a74e-7439-593f-8a18-3f18c309c538"}},{"node":{"frontmatter":{"title":"locale","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A set of configurations that defines the user’s language, country, tax rate, and other settings. Example: \"en_US\".</p>","id":"2f81fea0-2a2d-5e86-b5bb-4bf309a6b4e2"}},{"node":{"frontmatter":{"title":"media storage","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A dedicated space, which can be included on the content delivery network, for your media assets.</p>","id":"42224278-f4ec-5190-b05a-779be601e549"}},{"node":{"frontmatter":{"title":"markup","wordClasses":["noun"],"tags":["business","programming"],"synonyms":["Markdown"],"relatedTerms":null},"html":"<p>In marketing and retail, a percentage added to the cost of an item to determine the retail price.</p>\n<p>In development, a computer language that controls the processing, presentation, and formatting of text. Also, markup tags are snippets of code that add functionality or content to a CMS page or block.</p>","id":"728f53a5-442e-508e-aaf1-73f7fcbd76cc"}},{"node":{"frontmatter":{"title":"metadata","wordClasses":["noun"],"tags":["business","design","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Data that describes other data. Metadata helps users find and work with data.</p>","id":"3b175d71-054c-5397-9c3c-97ee3158e324"}},{"node":{"frontmatter":{"title":"metapackage","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["composer-types","package"]},"html":"<p>An empty package that contains requirements and will trigger their installation, but neither contains files nor writes anything to the filesystem. No dist or source key is required for installation.</p>","id":"5f59f6ab-513c-5072-a6ca-f8de5778fc52"}},{"node":{"frontmatter":{"title":"mixin","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["less","magento-ui-library","ui-component"]},"html":"<p>A class that contains a combination of methods from other classes. Mixins encourage code reuse and can be used to avoid the inheritance ambiguity that multiple inheritance can cause (the diamond problem), or to work around lack of support for multiple inheritance in a language.\nHow such a combination is done depends on the language, but it is not by inheritance. If a combination contains all methods of combined classes it is equivalent to multiple inheritance.</p>\n<p>Magento UI components, a Less frontend library, use a set of mixins for base elements to ease frontend theme development and customization.</p>","id":"788b3531-95bb-5522-aa47-fccc6be30513"}},{"node":{"frontmatter":{"title":"MFTF","wordClasses":["noun"],"tags":["magento-software","programming"],"synonyms":[],"relatedTerms":["cms-block","static-block","container","layout"]},"html":"<p>MFTF stands for Magento Functional Testing Framework. It provides a testing framework for Magento developers and software engineers, such as QA specialists, PHP developers, and system integrators. Developers and QA can write tests to attempt user interactions with web applications, verify functionality, and automate regression testing.</p>","id":"f1dfa387-6243-5404-ba71-dac51c6fbc8d"}},{"node":{"frontmatter":{"title":"namespace","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["php"]},"html":"<p>A set of symbols used to organize a variety of objects so that the objects may be referred to with a name.</p>\n<p>In PHP, a namespace determines where a PHP file is located within the namespace hierarchy. The same class name can be reused, but a namespace provides differentiation between files.</p>","id":"9917f041-4637-5ff3-ab8d-a8aa20abf5c3"}},{"node":{"frontmatter":{"title":"Naxsi","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["nginx"]},"html":"<p>An open-source web application firewall (WAF) for Nginx.</p>","id":"bc4d62c0-1871-59c4-8141-52ed213bb3dd"}},{"node":{"frontmatter":{"title":"Nginx","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["naxsi"]},"html":"<p>(Pronounced \"engine x\") A free, open-source software that functions as a web server or a reverse proxy (for TCP, UDP, HTTP, HTTPS, SMTP, POP3, and IMAP protocols), as well as a load balancer and an HTTP cache.</p>","id":"397756be-a5a7-5b85-a3c5-f87f47b807d7"}},{"node":{"frontmatter":{"title":"package","wordClasses":["verb"],"tags":["programming"],"synonyms":[],"relatedTerms":["composer-package","language-package","meta-package"]},"html":"<p>The process of creating a distributable module for Magento Marketplace or another distribution system.</p>","id":"2802ed8b-9b81-5bc0-b7c7-6f2f1ecaec87"}},{"node":{"frontmatter":{"title":"payment gateway","wordClasses":["noun"],"tags":["business","order","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A payment gateway is a third-party service that seamlessly processes credit card transactions without the customer leaving the merchant's site.</p>","id":"83d4cf37-8df2-5670-a0f2-8f20ac2aa682"}},{"node":{"frontmatter":{"title":"payments as a service","wordClasses":["noun"],"tags":["business","order","programming"],"synonyms":[],"relatedTerms":["cloud-services","platform-as-a-service","software-as-a-service"]},"html":"<p>A software as a service that connects international payment systems. It uses its own standard APIs and functions as a layer on top of the systems, enabling two-way communication between a system and the payments as a service software.</p>","id":"84e2e2e4-2afe-500a-bd10-8204b959a36d"}},{"node":{"frontmatter":{"title":"PHP","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["backend","html"]},"html":"<p>An open-source, server-side (backend) scripting language designed mainly for web development. The script is embedded within a Web page’s HTML. When a user has requested the page, the Web server calls PHP to read the script and perform its operation.</p>\n<p>PHP pages typically have file name suffixes that include: \".php\" \".php3,\" or \".phtml\". PHP pages are dynamic, driven by the how the script is read.</p>","id":"532e67a5-8cce-5bf9-b4ef-6226ef8df27c"}},{"node":{"frontmatter":{"title":"PHTML","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["html","php"]},"html":"<p>An HTML page including PHP script.</p>","id":"2f24e474-78cd-5c0c-b23e-bc28bf6b4ec2"}},{"node":{"frontmatter":{"title":"platform as a service","wordClasses":["noun"],"tags":["programming"],"synonyms":["PaaS"],"relatedTerms":["cloud services","payments-as-a-service","software-as-a-service"]},"html":"<p>A platform — used by Magento Cloud — that features cloud computing services that enable the development and management of applications.</p>\n<p>PaaS does not require customers to buy and manage infrastructure, including hardware, software, network, servers operating systems and storage. Customers can control running applications and, in some cases, the application-hosting configuration settings. “PaaS” can be used on second reference.</p>","id":"1d0806b3-fc71-5a5b-9b90-5a15baeeb2ba"}},{"node":{"frontmatter":{"title":"prefork","wordClasses":["verb"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>To split a process in advance, so similar processes are immediately available later, if required.</p>","id":"2e0ea5fc-bbb0-5551-87bb-dd579709deac"}},{"node":{"frontmatter":{"title":"publisher, subscriber pattern","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Where one or more \"publishers\" can send a message on a message bus without knowing who is interested in the message. Subscribers can listen to the message by \"subscribing\". The pattern is normally used as a one-to-many broadcast of messages, but it can be used as many-to-many, if appropriate.</p>","id":"f33603aa-a8e0-5087-8abd-574857e1552f"}},{"node":{"frontmatter":{"title":"PWA","wordClasses":["adjective","noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio","Community Engineering"],"relatedTerms":["react","upward"]},"html":"<p>A Progressive Web App, or PWA, is a web application that uses modern web technologies and design patterns to provide a reliable, fast, and engaging user experience. PWA sites are fast, secure, responsive for all devices, cross-browser compatible, supports an offline mode, etc.</p>\n<p>The Magento PWA Studio project is a set of developer tools that allow for the development, deployment, and maintenance of a PWA storefront on top of Magento 2. It uses modern <a href=\"https://magento-research.github.io/pwa-studio/technologies/tools-libraries/\">tools and libraries</a> to create a build system and framework that adheres to the Magento principle of extensibility.</p>\n<p>PWA is also a Magento Community Engineering project, open to contributions:</p>\n<ul>\n<li><a href=\"https://github.com/magento-research/pwa-studio\">GitHub Repository</a></li>\n<li><a href=\"https://app.zenhub.com/workspace/o/magento-research/pwa-studio/boards?repos=137249745\">ZenHub</a></li>\n<li><a href=\"https://magentocommeng.slack.com/messages/C8076E0KS\">#pwa Slack Channel</a></li>\n</ul>","id":"53078a9a-c02e-5c18-aae9-421ac0161d62"}},{"node":{"frontmatter":{"title":"React","wordClasses":["noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio"],"relatedTerms":["pwa"]},"html":"<p>PWA Studio uses React for development. React officially describes itself as a <em>JavaScript library for building user interfaces</em>. The library provides many features that make PWA development easier: builds UIs, declarative for describing the interface based on application states, and creates modular and reusable UI components.</p>","id":"bc949428-9010-5d82-b638-09ba4be6f06a"}},{"node":{"frontmatter":{"title":"Redux","wordClasses":["noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio"],"relatedTerms":["pwa","react"]},"html":"<p>PWA Studio uses Redux for development. Redux is a JavaScript library used for managing state in a web application.</p>\n<p>It provides a global store object that holds application state that multiple components depend on. Components that plug into the store have direct access to the specific state data they need. This library is often paired with React to alleviate the problem of passing data down multiple component layers.</p>","id":"9f72ead4-eb2d-55d0-9fe9-9aaf60c85778"}},{"node":{"frontmatter":{"title":"release candidate","wordClasses":["noun"],"tags":["magento-software","programming"],"synonyms":["beta-version","rc"],"relatedTerms":null},"html":"<p>A type of beta version that is almost ready to become finalized, unless significant bugs emerge. The Magento community is encouraged to provide feedback and Pull Requests (PR) in GitHub to fix errors in code, design, and documentation.</p>","id":"694a4621-eb8a-5dd8-8a5c-c9f7ed3f4d17"}},{"node":{"frontmatter":{"title":"robots.txt","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A file placed on a website that tells search-engine crawlers which pages not to index.</p>","id":"5afe821a-9bf1-5284-a7a9-fc3cca1411b2"}},{"node":{"frontmatter":{"title":"Sass","wordClasses":["noun"],"tags":["design","programming"],"synonyms":[],"relatedTerms":["compass","css"]},"html":"<p>Abbreviation for Syntactically Awesome Stylesheets.  A language that extends CSS — adding inline imports, mixins, nested rules, and variables — and keeps it well-organized with the assistance of the Compass style library.</p>","id":"b50ba9bb-38e9-5eba-9797-f1e383fd748a"}},{"node":{"frontmatter":{"title":"security certificate","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>A tool which securely validates and encrypts data that travels both ways between the browser (client) and server. Sites with a security certificate use the “HTTPS” protocol, displayed in the web address bar. SSL is the standard certificate.</p>","id":"adb7be7e-011f-577c-aa9a-ae47db77cd17"}},{"node":{"frontmatter":{"title":"server side","wordClasses":["noun"],"tags":["programming"],"synonyms":["backend"],"relatedTerms":["backend","cache-backend","frontend"]},"html":"<p>In a client-server application, backend code runs on a server. The frontend component, or client, is an interface on a local computer or workstation that and enables users to access the remote server and manipulate the backend code. A user cannot directly access backend code.</p>\n<p>In Magento, customers interact with the storefront (UI), merchants interact with the Magento Admin (front end client / browser). These interactions launch the server-side \"backend\" code, or Magento application programs, remotely.</p>","id":"fdf9046a-dba0-54c3-969b-faf66a9930dc"}},{"node":{"frontmatter":{"title":"service contract","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["php","web-api"]},"html":"<p>A set of PHP interfaces that are defined for a module. A service contract includes data interfaces, which preserve data integrity, and service interfaces, which hide business logic details from service requestors such as controllers, web services, and other modules. Web APIs can be bound to service contracts via configuration files.</p>","id":"6d93cae8-d587-5518-b3d6-fb5179322b7a"}},{"node":{"frontmatter":{"title":"service worker","wordClasses":["noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio"],"relatedTerms":["pwa"]},"html":"<p>A service worker is a script that runs in the background. Progressive web applications use service workers for caching and resource retrieval.</p>","id":"c9c009a6-9ae5-5b64-94da-aa80dee78793"}},{"node":{"frontmatter":{"title":"shopping cart","wordClasses":["noun"],"tags":["business","design","product","programming"],"synonyms":["cart","basket"],"relatedTerms":["cart-rule"]},"html":"<p>The set of products that a customer has selected to purchase, but has not yet purchased. Also refers to an area of an ecommerce site where these products can be found in order to review and checkout.</p>","id":"767d579e-dbaa-581f-aa32-254f5ab3611a"}},{"node":{"frontmatter":{"title":"SKU","wordClasses":["noun"],"tags":["business","pricing","product","programming"],"synonyms":[],"relatedTerms":[]},"html":"<p>Abbreviation for Stock Keeping Unit. A number or code assigned to a product to identify the product, options, price, and manufacturer.</p>","id":"fe12a10c-518a-5419-912c-9e71d0aa830b"}},{"node":{"frontmatter":{"title":"software as a service","wordClasses":["noun"],"tags":["programming"],"synonyms":["SaaS"],"relatedTerms":["cloud services","payments-as-a-service","platform-as-a-service"]},"html":"<p>A software delivery model where the vendor provides the software and hosting environment, and customers pay for the service by subscription or per use.</p>","id":"119ca192-5106-5720-b15e-8bfe205e4bc5"}},{"node":{"frontmatter":{"title":"translation file","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["csv"]},"html":"<p>Comma-separated value (CSV) message catalog files that provide translations for strings displayed in Magento.</p>","id":"ee49f122-d8e3-5774-9f03-6229845ec9e0"}},{"node":{"frontmatter":{"title":"UI component","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["javascript","layout","magento-component","page-builder"]},"html":"<p>A tag designed for Magento 2 software to enable simpler and more flexible user interface (UI) rendering.\nThe goals of the UI component system include the following:</p>\n<ul>\n<li>Simplifying Layout Handle XML files</li>\n<li>Moving Magento Admin user interface elements from HTML+Javascript to a “pure javascript” custom widget system</li>\n<li>Enabling the creation of more complex UI components out of smaller components</li>\n<li>Pre-rendering data for UI components as JSON, binding closely to Magento backend data objects</li>\n<li>Using AJAX to update component data</li>\n<li>Introducing a new DSL for creating all of the above</li>\n</ul>","id":"10c47049-8efb-557c-abf2-74260ec4a24b"}},{"node":{"frontmatter":{"title":"UPWARD","wordClasses":["noun"],"tags":["design","magento-software","programming"],"synonyms":["PWA Studio","Unified Progressive Web App Response Definition"],"relatedTerms":["pwa"]},"html":"<p>PWA Studio uses UPWARD in development. UPWARD is an acronym for Unified Progressive Web App Response Definition. An UPWARD definition file describes how a web server delivers and supports a Progressive Web Application.</p>\n<p>UPWARD definition files provide details about server behavior using platform-independent, declarative language. This lets a Progressive Web Application run on top of an UPWARD-compliant server in any language on any tech stack because the application is only concerned about the HTTP endpoint behavior from the UPWARD server.</p>\n<p>An UPWARD server uses a definition file to determine the appropriate process or service for a request from an application shell. It describes how the server should handle a request and build the response for it.</p>\n<p>A PWA project can include an UPWARD definition file to specify its service dependencies.</p>","id":"11a60776-2ee9-521a-8054-c598d6218f29"}},{"node":{"frontmatter":{"title":"virtual type","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["php"]},"html":"<p>Virtual types are a way to inject different dependencies into existing PHP classes without affecting other classes and without having to create a new class file. Virtual types can only be referenced in by argument overrides in a <type> element within di.xml files, never in source code. They can't be extended and they can't be references as dependencies in a classes constructor.</p>","id":"6d78f56e-861c-5bbb-b5dc-0a8f7abda98a"}},{"node":{"frontmatter":{"title":"web API","wordClasses":["noun"],"tags":["programming"],"synonyms":[],"relatedTerms":["api"]},"html":"<p>An application programming interface (API) for a web server or browser, usually limited to the client side.</p>","id":"1b1b7af8-0b8f-52f5-ab7a-a2463d7fe885"}},{"node":{"frontmatter":{"title":"XML","wordClasses":["noun"],"tags":["programming"],"synonyms":["Extensible Markup Language"],"relatedTerms":[]},"html":"<p>Abbreviation for \"Extensible Markup Language\". A markup format derived from SGML that is used to format information for publication and distribution.</p>","id":"c5f5fd00-112b-59e3-8642-24c43c7dc6e2"}}]},"tagListJson":{"slug":"programming"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"programming"}}